{"authors": ["Rory Smith"], "date_download": "2020-12-28 15:49:08", "date_modify": "2020-12-28 15:49:08", "date_publish": "2020-12-16 23:22:17", "description": "A lineup altered by injury, and supplemented by youth, summons the energy to beat Tottenham at Anfield.", "filename": "2020_12_16_sports_soccer_liverpool-tottenham_1609170548.html", "image_url": "https://static01.nyt.com/images/2020/12/16/sports/16onsoccer-firminosub/16onsoccer-firminosub-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_16_sports_soccer_liverpool-tottenham_1609170548.html", "title": "Liverpool Pulls in Front, but Premier League Race Has Far to Go", "title_page": "Roberto Firmino's Goal Vaults Liverpool Over Tottenham in Premier League - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "Manchester City has Phil Foden, Manchester United has Mason Greenwood, Chelsea has Mason Mount. The days when it was rare for a young English player to make the grade, for him to be given a chance in the Premier League, are long gone. It is no longer possible to celebrate each one individually, as it would have been even five years ago. There just is not the time.\nJones’s progress, too, is testament to the circumstances in which he has been given his chance. Liverpool’s early season has been defined by injuries: not just the season-ending damage sustained by Virgil van Dijk and Joe Gomez, but the seemingly endless run of needling, niggling problems that have made Klopp such an ardent advocate for teams to be able to call on more substitutes. A hamstring here, a knee problem there, three weeks out, four weeks out, another game with Liverpool’s resources depleted.\nIt creates a phenomenon in which watching Liverpool is to note that which is absent more than what is present: How will Klopp’s team cope without Van Dijk? Does it have the same aura without any of its senior, specialist central defenders? Is it running out of energy? Has it lost its spark? It has been so powerful that it has been possible not to notice Liverpool’s presence close to, or now at, the summit of the Premier League.\nBut most of all, Jones’s transition into Liverpool’s team has been so smooth because of him. His teammates joke about his self-assurance, his lack of doubt, his iron self-belief. Klopp has found that he is not backward in coming forward, in asserting that he should, perhaps, be in the team ahead of some of the celebrated stars who have conquered both England and Europe with this team.\nAll of that manifests in his play. Jones demands the ball constantly, drifting into space, directing his teammates, dictating the game. He is not cowed by the standards he must meet. His colleagues have responded with the most significant judgment of all: their trust. It is possible not to notice Jones because he looks like he belongs.\nNone of that, though, should diminish what an achievement it is both for him — winning a place in one of Europe’s best teams at age 19 is, after all, no mean feat — and for Liverpool.", "url": "https://www.nytimes.com/2020/12/16/sports/soccer/liverpool-tottenham.html"}