{"authors": ["David Mccabe", "Cecilia Kang", "Daisuke Wakabayashi"], "date_download": "2020-12-28 15:49:15", "date_modify": "2020-12-28 15:49:15", "date_publish": "2020-12-17 17:55:37", "description": "More than 30 states said that the company downplayed websites that let users search for information in specialized areas.", "filename": "2020_12_17_technology_google-antitrust-monopoly_1609170555.html", "image_url": "https://static01.nyt.com/images/2020/12/18/business/17googlestates-print1/17googlestates-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_17_technology_google-antitrust-monopoly_1609170555.html", "title": "Google’s Legal Peril Grows in Face of Third Antitrust Suit", "title_page": "Google’s Legal Peril Grows in Face of Third Antitrust Suit - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "More than 30 states added to Google’s mushrooming legal woes on Thursday, accusing the Silicon Valley titan of illegally arranging its search results to push out smaller rivals.\nOne day after 10 other states accused Google of abusing its dominance in advertising and overcharging publishers, and two months after the Justice Department said the company’s deals with other tech giants throttled competition, the bipartisan group of state prosecutors said in a lawsuit on Thursday that Google downplayed websites that let users search for information in specialized areas like home repair services and travel reviews. The prosecutors also accused the company of using exclusive deals with phone makers like Apple to prioritize Google’s search service over rivals like Bing and DuckDuckGo.\nThat suppression, the states said in their lawsuit, has locked in Google’s nearly 90 percent market dominance in search and has made it impossible for the smaller companies to grow into formidable competitors. Google has sought to extend that dominance to new venues like home voice assistants, said the prosecutors, from states including Colorado, Nebraska, New York and Utah.\nThe cascade of lawsuits against Google, which the company says it will fight in court, are indicative of the growing backlash against the largest tech companies, a movement that increasingly looks like it will usher in major changes for some of the world’s most popular digital services.", "url": "https://www.nytimes.com/2020/12/17/technology/google-antitrust-monopoly.html"}