{"authors": ["Luke Broadwater", "Alan Rappeport"], "date_download": "2020-12-28 15:49:07", "date_modify": "2020-12-28 15:49:07", "date_publish": "2020-12-23 01:38:34", "description": "The president sought bigger checks for Americans and a bill that dealt more specifically with pandemic relief.", "filename": "2020_12_22_us_politics_trump-coronavirus-bill_1609170547.html", "image_url": "https://static01.nyt.com/images/2020/12/19/us/politics/22dc-stimulus-trump/19dc-counsel-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_22_us_politics_trump-coronavirus-bill_1609170547.html", "title": "Trump Calls Covid Relief Bill a 'Disgrace' and Demands Changes", "title_page": "Trump Calls Covid Relief Bill a 'Disgrace' and Demands Changes - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "In a CNBC interview on Monday, Mr. Mnuchin said, “It was a great birthday present for me to have Congress pass this today.”\nHe had said hundreds of dollars in direct payments authorized by the bill could begin reaching individual Americans as early as next week.\nA spokeswoman for Mr. Mnuchin also cited his role in the negotiations earlier on Tuesday, noting that he had participated in 190 calls about the legislation between Dec. 14 and Dec. 20 that included the president, Treasury staff members and congressional leaders. During the talks, Mr. Mnuchin pushed for bigger direct payments on behalf of the president in exchange for cutting supplemental unemployment benefits.\nThe Second Stimulus Answers to Your Questions About the Stimulus Bill Updated Dec 27, 2020 The economic relief package, which President Trump signed on Sunday night, will issue stimulus payments of $600 and distribute a federal unemployment benefit of $300 for at least 10 weeks. Find more about the plan and what’s in it for you. For details on how to get assistance, check out our Hub for Help. Will I receive another stimulus payment? Individual adults with adjusted gross income on their 2019 tax returns of up to $75,000 a year would receive a $600 payment, and heads of households making up to $112,500 and a couple (or someone whose spouse died in 2020) earning up to $150,000 a year would get twice that amount. If they have dependent children, they would also get $600 for each child. People with incomes just above these levels would receive a partial payment that declines by $5 for every $100 in income. When might my payment arrive? Treasury Secretary Steven Mnuchin told CNBC that he expected the first payments to go out before the end of the year. But it will be a while before all eligible people receive their money. Does the agreement affect unemployment insurance? Lawmakers agreed to extend the amount of time that people can collect unemployment benefits and restart an extra federal benefit that is provided on top of the usual state benefit. But instead of $600 a week, it would be $300. That would last through March 14. I am behind on my rent or expect to be soon. Will I receive any relief? The agreement would provide $25 billion to be distributed through state and local governments to help renters who have fallen behind. To receive assistance, households would have to meet several conditions: Household income (for 2020) cannot exceed more than 80 percent of the area median income; at least one household member must be at risk of homelessness or housing instability; and individuals must qualify for unemployment benefits or have experienced financial hardship — directly or indirectly — because of the pandemic. The agreement said assistance would be prioritized for families with lower incomes and that have been unemployed for three months or more.\nCurrent and former administration officials speculated on Tuesday evening that Mr. Trump did not like the narrative that he had been sidelined from the negotiations and that calling for higher direct payments was a political move to please his base.\nIn order to pass the bill before Christmas and hasten its enactment, congressional leaders combined the relief bill with the $1.4 trillion year-end spending bill to fund the government through the end of the fiscal year on Sept. 30. That bill also served as a vehicle to pass myriad new policies, such as the establishment of two Smithsonian museums, a ban on surprise medical bills and a restoration of Pell grants for incarcerated students.\nBut the voluminous combined bill — weighing in at 5,593 pages — and the speed with which it was passed on Monday drew criticism from both the left and the right, even as most in Congress voted for the legislation without having the time to fully read it.\nRepresentative Alexandria Ocasio-Cortez, Democrat of New York, likened the rushed vote on so many unread measures to “hostage-taking,” and Senator Ted Cruz, Republican of Texas, wrote on Twitter that it was “ABSURD.”", "url": "https://www.nytimes.com/2020/12/22/us/politics/trump-coronavirus-bill.html"}