{"authors": ["Ben Casselman", "Jim Tankersley"], "date_download": "2020-12-28 15:49:04", "date_modify": "2020-12-28 15:49:04", "date_publish": "2020-12-21 00:27:23", "description": "The aid package will keep millions from losing jobless benefits. But it comes too late to prevent lasting damage to many families and businesses.", "filename": "2020_12_20_business_economy_stimulus-bill-congress_1609170544.html", "image_url": "https://static01.nyt.com/images/2020/12/18/us/00stimulus-economy01/00stimulus-economy01-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_20_business_economy_stimulus-bill-congress_1609170544.html", "title": "Stimulus Deal Provides Economic Relief, for Now", "title_page": "Stimulus Deal Provides Economic Relief, for Now - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "The recovery may also be hurt by what Congress chose not to do. Looming largest is negotiators’ inability to reach agreement on hundreds of billions of dollars to patch holes in state and local budgets that have cost 1.3 million jobs since March. Forecasters say the shortfall in revenue makes continuing layoffs likely.\n“Things are not as bad as they looked in the dark days of March and April, but there still are risks,” said Tracy Gordon, a senior fellow at the Urban Institute in Washington. “It takes a while for things going on in the economy to wend their way into state budgets.”\nPresident-elect Joseph R. Biden Jr. and congressional Democrats have characterized the aid package as a down payment to avoid short-term economic harm, an effort that should be followed by further aid to ensure a robust recovery.\nBut Republican opposition — and rising optimism that vaccine deployment could begin to arrest the pandemic and kick-start tourism, live events, indoor dining and other slumping industries early in the new year — makes it likely that Congress will have a hard time passing another large aid package. Achieving that goal in Mr. Biden’s early days as president could hinge on whether Democrats win two runoff elections in Georgia that will determine control of the Senate.\nLawmakers reached quick agreement on the $2.2 trillion CARES Act in March, but they were deadlocked for months on a second round of relief after the Democratic-controlled House passed a $3 trillion version in May. The delay took a toll on the recovery, hurting both households and business owners.\nThe recovery got off to a fast start when businesses began to reopen in May and June, but it has slowed sharply, and in recent weeks there have been signs that it is going into reverse. Layoffs are rising, retail sales are falling and the surge in virus cases has led many states to reimpose restrictions on business and consumer activity.", "url": "https://www.nytimes.com/2020/12/20/business/economy/stimulus-bill-congress.html"}