{"authors": ["Emily Cochrane"], "date_download": "2020-12-28 15:49:07", "date_modify": "2020-12-28 15:49:07", "date_publish": "2020-12-22 00:41:20", "description": "Lawmakers approved a $900 billion pandemic aid bill that provides a $600 payment for most Americans.", "filename": "2020_12_21_us_politics_coronavirus-stimulus-deal_1609170547.html", "image_url": "https://static01.nyt.com/images/2020/12/21/us/politics/21dc-stimulus/21dc-stimulus-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_21_us_politics_coronavirus-stimulus-deal_1609170547.html", "title": "Congress Passes Huge Coronavirus Relief Bill", "title_page": "Congress Rushes to Pass Huge Coronavirus Relief Bill - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "The final proposal includes $69 billion for the distribution of a coronavirus vaccine and more than $22 billion for states to conduct testing, tracing and coronavirus mitigation programs. It will also provide $13 billion in increased nutrition assistance, $7 billion for broadband access, $45 billion for transportation and transit agencies and $25 billion in rental assistance.\nIt revives a popular business loan program, the Paycheck Protection Program, and allows businesses to receive a second loan and expand eligibility under that program for nonprofit organizations, local newspapers and radio and TV broadcasters. It will allocate $15 billion for performance venues, independent movie theaters and other cultural institutions devastated by the restrictions imposed to stop the spread of the virus.\nThe Second Stimulus Answers to Your Questions About the Stimulus Bill Updated Dec 28, 2020 The economic relief package, which President Trump signed on Sunday night, will issue payments of $600 and distribute a federal unemployment benefit of $300 for at least 10 weeks. Find more about the plan and what’s in it for you. For details on how to get assistance, check out our Hub for Help. Will I receive another stimulus payment? Individual adults with adjusted gross income on their 2019 tax returns of up to $75,000 a year would receive a $600 payment, and heads of households making up to $112,500 and a couple (or someone whose spouse died in 2020) earning up to $150,000 a year would get twice that amount. If they have dependent children, they would also get $600 for each child. People with incomes just above these levels would receive a partial payment that declines by $5 for every $100 in income. When might my payment arrive? Treasury Secretary Steven Mnuchin told CNBC that he expected the first payments to go out before the end of the year. But it will be a while before all eligible people receive their money. Does the agreement affect unemployment insurance? Lawmakers agreed to extend the amount of time that people can collect unemployment benefits and restart an extra federal benefit that is provided on top of the usual state benefit. But instead of $600 a week, it would be $300. That would last through March 14. I am behind on my rent or expect to be soon. Will I receive any relief? The agreement would provide $25 billion to be distributed through state and local governments to help renters who have fallen behind. To receive assistance, households would have to meet several conditions: Household income (for 2020) cannot exceed more than 80 percent of the area median income; at least one household member must be at risk of homelessness or housing instability; and individuals must qualify for unemployment benefits or have experienced financial hardship — directly or indirectly — because of the pandemic. The agreement said assistance would be prioritized for families with lower incomes and that have been unemployed for three months or more.\nThe bill also ensures that businesses will be able to deduct payroll costs and other expenses covered by the Paycheck Protection Program, and it will expand a tax credit that subsidizes wages for businesses hurt by the pandemic.\nThe bill contains $82 billion in education funding, with about $54 billion going to the nation’s K-12 schools and $22.7 billion going to colleges and universities, funds that still fall short of what both sectors say they need to blunt the effect of the virus, which has crippled school budgets and left its most vulnerable students in dire academic and financial straits.\nGovernors would receive $4.1 billion in a separate pot of relief funding, $2.75 billion of which would be reserved to support private and parochial schools, after Democrats fought to ensure the funding would not be used for private school vouchers. The bill also includes requirements and restrictions for how private schools that have received funding under the Paycheck Protection Program are eligible to receive state funds.\nThe bill also includes a number of tax provisions that are less significant to the overall economy but will make a big difference for some individuals and businesses. Republicans also secured a tax write-off, favored by corporate lobbyists and the White House, that Democrats have derided as a “three-martini” deduction allowing businesses to deduct 100 percent, instead of up to half, of their meal expenses.\nLow-income workers will be able to qualify for tax credits based on either their 2019 or 2020 income — a priority for Democrats because people who lost jobs during the pandemic could otherwise lose out on programs like the earned-income tax credit that require people to work to qualify for the full benefit.", "url": "https://www.nytimes.com/2020/12/21/us/politics/coronavirus-stimulus-deal.html"}