{"authors": ["Choe Sang-Hun"], "date_download": "2020-12-28 15:49:05", "date_modify": "2020-12-28 15:49:05", "date_publish": "2020-12-17 17:43:00", "description": "He was celebrated for movies centered on society’s underbelly, but he was later accused of sexual misconduct. He died of Covid-19.", "filename": "2020_12_17_movies_kim-ki-duk-dead_1609170545.html", "image_url": "https://static01.nyt.com/images/2020/12/22/world/00Kim01/00Kim01-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_17_movies_kim-ki-duk-dead_1609170545.html", "title": "Kim Ki-duk, Award-Winning South Korean Filmmaker, Dies at 59", "title_page": "Kim Ki-duk, Award-Winning South Korean Filmmaker, Dies at 59 - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "“Pieta” (2012) is perhaps Mr. Kim’s most recognized film. A deeply unnerving tale, it follows a mother and son on a quest for revenge and redemption and includes graphic scenes of torture and violence. It won the Golden Lion at the 2012 Venice Film Festival. The year before, Mr. Kim had received an award at the Cannes festival for “Arirang,” a documentary about a near-fatal accident that occurred on one of his shoots.\nWhile his movies often garnered critical acclaim abroad, most of them were commercial failures in South Korea.\n“I made this movie so that we can reflect upon ourselves living in this miserable world where you are lauded for succeeding in life even if you do so through lawbreaking and corruption,” he said after his movie “One on One,” about the brutal murder of a high school girl, flopped in 2014. “I made it hoping that some will understand it. If no one does, I can’t do anything about it.”\nMany moviegoers, especially women, were disturbed by what they considered perverted, misogynistic and sadistic scenes of violence against women in Mr. Kim’s movies. The criticism grew significantly in 2017 when an actress starring in Mr. Kim’s movie “Moebius” accused him of forcing her into shooting a sexual scene against her will.", "url": "https://www.nytimes.com/2020/12/17/movies/kim-ki-duk-dead.html"}