{"authors": ["Marc Stein"], "date_download": "2020-12-28 15:49:08", "date_modify": "2020-12-28 15:49:08", "date_publish": "2020-12-15 14:01:05", "description": "Bill Duffy, who founded BDA Sports Management more than two decades ago, represents rising basketball stars like the N.B.A.’s Luka Doncic and the W.N.B.A.’s Sabrina Ionescu.", "filename": "2020_12_15_sports_basketball_wme-endeavor-bda-sports-bill-duffy_1609170548.html", "image_url": "https://static01.nyt.com/images/2020/12/15/sports/15nba-agencies-1/15nba-agencies-1-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_15_sports_basketball_wme-endeavor-bda-sports-bill-duffy_1609170548.html", "title": "Endeavor Expands N.B.A. Talent Reach With Stake in BDA Sports", "title_page": "Endeavor Expands N.B.A. Talent Reach With Stake in BDA Sports - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "Endeavor, the entertainment and sports conglomerate, expanded its sports representation business Tuesday by purchasing a stake in BDA Sports Management, the firm led by the influential N.B.A. agent Bill Duffy.\nThe partnership calls for Duffy, who represents the rising basketball stars Luka Doncic and Sabrina Ionescu, to become an adviser in the sports division of William Morris Endeavor, one of Hollywood’s major talent agencies. Duffy will continue to serve as chairman and chief executive of BDA Sports, which will retain its own branding and represents an estimated 130 players in the N.B.A., W.N.B.A. and professional leagues internationally.\n“We don’t really have an uber-N.B.A.-agent in our company,” Mark Shapiro, Endeavor’s president, said in an interview. “I’m certain this will accelerate our growth plan as it relates to representing more N.B.A. players both on and off the court.”\nTerms of the agreement were not disclosed, but Shapiro described Endeavor’s stake as a “meaningful, strategic investment.” WME Sports has provided full-service representation for several tennis and golf clients, including the tennis stars Serena Williams and Naomi Osaka, but the sports division’s co-head, Karen Brodkin, said the alliance with Duffy was part of a broader strategy to work with “more clients earlier in their career trajectory” in sports where they haven’t historically. Duffy said the union with WME would position BDA Sports “to build something even bigger and better than what we’ve been able to do.”", "url": "https://www.nytimes.com/2020/12/15/sports/basketball/wme-endeavor-bda-sports-bill-duffy.html"}