{"authors": ["Pranshu Verma", "Mark Mazzetti"], "date_download": "2020-12-28 15:49:06", "date_modify": "2020-12-28 15:49:06", "date_publish": "2020-12-22 23:58:20", "description": "If the request is granted, it could potentially provide a legal basis to dismiss a separate case against Crown Prince Mohammed bin Salman for the killing of Jamal Khashoggi.", "filename": "2020_12_22_us_politics_mbs-saudi-immunity-trump_1609170546.html", "image_url": "https://static01.nyt.com/images/2020/12/22/us/politics/22dc-mbs/22dc-mbs-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_22_us_politics_mbs-saudi-immunity-trump_1609170546.html", "title": "US Considers Granting Immunity to MBS in Khashoggi Case", "title_page": "US Considers Granting Immunity to MBS in Khashoggi Case - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "WASHINGTON — The Trump administration is considering a request to grant Crown Prince Mohammed bin Salman of Saudi Arabia immunity from a federal lawsuit that accuses him of trying to kill a former Saudi intelligence official living in Canada, legal documents related to the case show.\nIf the request is granted, the State Department’s recommendation could potentially provide a legal basis to dismiss other cases against the prince, most notably one where he is accused of directing the assassination of the Saudi dissident Jamal Khashoggi in 2018, a person familiar with the case said.\nThe immunity request stems from a case involving Saad Aljabri, a former top aide in the Saudi Interior Ministry, who in August publicly accused Prince Mohammed of sending a team of agents to Canada to kill him. His lawsuit offered little evidence to back up his claims.\nState Department officials last month gave lawyers for Mr. Aljabri a questionnaire asking for their legal views on Saudi Arabia’s request to grant the prince immunity against claims made in the lawsuit, documents show.", "url": "https://www.nytimes.com/2020/12/22/us/politics/mbs-saudi-immunity-trump.html"}