{"authors": ["Jack Ewing"], "date_download": "2020-12-28 15:49:04", "date_modify": "2020-12-28 15:49:04", "date_publish": "2020-12-17 13:13:30", "description": null, "filename": "2020_12_17_business_the-bank-of-england-holds-interest-rates-steady-as-brexit-talks-continue_1609170544.html", "image_url": "https://static01.nyt.com/images/2020/12/17/business/17economy-briefing-bankofengland/merlin_179614218_6f28b416-7a4e-45dd-8e3d-a42c74314a7f-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_17_business_the-bank-of-england-holds-interest-rates-steady-as-brexit-talks-continue_1609170544.html", "title": "The Bank of England holds interest rates steady as Brexit talks continue.", "title_page": "The Bank of England holds interest rates steady as Brexit talks continue. - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "The Bank of England, which has been battling not only a pandemic but the threat of a disruptive exit from the European Union, made no changes to its monetary policy Thursday amid signs that both threats could be receding.\nThe central bank left its benchmark interest rate at 0.1 percent and did not increase its purchases of government bonds. In November, at its last meeting, the bank’s Monetary Policy Committee expanded the bond purchases, a way of holding down market interest rates, by £150 billion. The bank said Thursday it would continue to aim for total asset purchases of £895 billion, or $1.2 trillion.\nThe bank also extended by six months a program that allows commercial banks to borrow money at or close to the benchmark interest rate, if they funnel the money to small and midsize businesses.\nSuccessful development of vaccines against the coronavirus are “likely to reduce the downside risks to the economic outlook from Covid,” the Monetary Policy Committee said in a statement. But the committee also said growth would be “a little weaker” than policymakers expected in November because of sharper lockdowns.", "url": "https://www.nytimes.com/2020/12/17/business/the-bank-of-england-holds-interest-rates-steady-as-brexit-talks-continue.html"}