{"authors": ["Jon Pareles"], "date_download": "2020-12-28 15:49:06", "date_modify": "2020-12-28 15:49:06", "date_publish": "2020-12-16 21:33:43", "description": "A new six-part Netflix series explores half a century of music under pressure.", "filename": "2020_12_16_arts_music_break-it-all-latin-rock-netflix_1609170546.html", "image_url": "https://static01.nyt.com/images/2020/12/19/arts/16latinrock3/16latinrock3-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_16_arts_music_break-it-all-latin-rock-netflix_1609170546.html", "title": "‘Break It All’ Celebrates the Oppositional Energy of Latin Rock", "title_page": "‘Break It All’ Celebrates the Oppositional Energy of Latin Rock - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "Latin America has taken rock seriously. Seriously enough for governments to suppress it. Seriously enough for bands to sing about political issues, societal troubles and the spirit of rebellion. Seriously enough for fans to risk arrests and beatings to see a concert. While Latin rock can be thoroughly entertaining — catchy, playful, rambunctious, over the top — it rarely settles for being mere entertainment. There’s often far more going on behind the melody, rhythm and noise.\n“Break It All,” a six-part documentary series named after a song by Los Shakers that arrives Wednesday on Netflix, hurtles through the history of rock in Latin America, from the 1950s — when Ritchie Valens, a Mexican-American born in California, turned the traditional Mexican song “La Bamba” into an American rock ’n’ roll cornerstone — to the 21st century.\n“Rock ’n’ roll is a form of communication,” Àlex Lora, of the blunt and boisterous Mexican hard-rock band El Tri, says in the documentary. “And it would be illogical, since there are millions of people who speak the language of Cervantes, if we didn’t have our own rock ’n’ roll.”", "url": "https://www.nytimes.com/2020/12/16/arts/music/break-it-all-latin-rock-netflix.html"}