{"authors": ["Derrick Bryson Taylor"], "date_download": "2020-12-28 15:49:10", "date_modify": "2020-12-28 15:49:10", "date_publish": "2020-12-18 10:26:36", "description": "Both Sony and Microsoft, the maker of Xbox, said they would also offer refunds to gamers while the developer of the much-hyped title works to fix bugs and glitches.", "filename": "2020_12_18_technology_cyberpunk-2077-refund_1609170550.html", "image_url": "https://static01.nyt.com/images/2020/12/18/world/18xp-cyberpunk/18xp-cyberpunk-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_18_technology_cyberpunk-2077-refund_1609170550.html", "title": "Sony Removes Cyberpunk 2077 From PlayStation Store After Complaints", "title_page": "Sony Pulls Cyberpunk 2077 From PlayStation Store and Will Offer Refunds - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "Sony, the company that owns and operates PlayStation, announced late Thursday that it would offer refunds to people who purchased Cyberpunk 2077 and remove what had been one of the year’s most highly anticipated video games from its online store, after a week of negative reviews and criticism from users over its poor performance.\nIn a statement on PlayStation’s website, Sony said it would offer full refunds to users who purchased the game through the PlayStation Store. Cyberpunk 2077, the company said, would also be removed from the store until further notice. Microsoft, the company that owns Xbox, announced on Friday that it would also be offering refunds to people who purchased Cyberpunk 2077 through the Microsoft store.\nThe game retails for $59.99, and its developer, CD Projekt Red, had touted receiving eight million pre-orders of the game.\nCD Projekt Red said Friday that Sony’s decision to “temporarily suspend” sales of the game came after a discussion with the company, which is based in Warsaw.", "url": "https://www.nytimes.com/2020/12/18/technology/cyberpunk-2077-refund.html"}