{"authors": ["Julia Jacobs"], "date_download": "2020-12-28 15:49:07", "date_modify": "2020-12-28 15:49:07", "date_publish": "2020-11-24 22:24:26", "description": "The comedian was unhappy that “Chappelle’s Show” was licensed to Netflix and HBO Max, saying that he should have been paid.", "filename": "2020_11_24_arts_television_chappelles-show-netflix_1609170547.html", "image_url": "https://static01.nyt.com/images/2020/11/24/arts/24chappelle2/24chappelle2-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_11_24_arts_television_chappelles-show-netflix_1609170547.html", "title": "'Chappelle's Show' Off Netflix as Comedian Fights ViacomCBS", "title_page": "'Chappelle's Show' Off Netflix as Comedian Fights ViacomCBS - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "In response, Chappelle went to Netflix, the home of several of his stand-up specials, and asked the service to stop streaming “Chappelle’s Show,” which had been broadcast on Comedy Central from 2003 to 2006. Netflix agreed, and pulled the show early on Tuesday morning after streaming it for less than a month. Hours later, Chappelle, 47, posted the 18-minute video on Instagram, which he described as “publicly flogging a network,” referring to ViacomCBS, which owns Comedy Central.\nA spokeswoman for Netflix confirmed that the service had removed the sketch show overnight at Chappelle’s request but declined to comment further. ViacomCBS and HBO did not immediately respond to requests for comment.\n“Chappelle’s Show” lasted for two full seasons before Chappelle, the show’s star and creator, walked away from it, sparking questions about how he could have abandoned what could have amounted to a $50 million deal. In 2006, Chappelle told Oprah Winfrey in the first interview after his departure that he had left the show in part because of stress and in part because he felt conflicted about the material he was producing, saying, “I was doing sketches that were funny, but were socially irresponsible.”\nThe show often dealt with issues of race and sexuality in Chappelle’s notoriously uncensored, boundary-pushing style. In one famous sketch, Chappelle played a blind white supremacist who does not know he is Black.\nIn his Instagram video, titled “Unforgiven,” Chappelle said he felt he was never properly paid for “Chappelle’s Show” after he left. At the time, Comedy Central released three episodes of an abbreviated third season from material it already had.", "url": "https://www.nytimes.com/2020/11/24/arts/television/chappelles-show-netflix.html"}