{"authors": ["Maggie Haberman", "Michael S. Schmidt"], "date_download": "2020-12-28 15:49:05", "date_modify": "2020-12-28 15:49:05", "date_publish": "2020-12-23 00:03:43", "description": "The pre-Christmas wave of 20 pardons and commutations are not likely to be the last before Mr. Trump leaves office on Jan. 20.", "filename": "2020_12_22_us_politics_trump-pardons_1609170545.html", "image_url": "https://static01.nyt.com/images/2020/12/22/us/politics/22dc-trump-pardons/22dc-trump-pardons-facebookJumbo-v2.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_22_us_politics_trump-pardons_1609170545.html", "title": "Trump Pardons Two Russia Inquiry Figures and Blackwater Guards", "title_page": "Trump Pardons Four Blackwater Guards and Two Russia Inquiry Figures - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "In an audacious pre-Christmas round of pardons, President Trump granted clemency on Tuesday to two people who pleaded guilty in the special counsel’s Russia inquiry, four Blackwater guards convicted in connection with the killing of Iraqi civilians and three corrupt former Republican members of Congress.\nIt was a remarkable assertion of pardon power by a president who continues to dispute his loss in the election and might well be followed by other pardons in the weeks before he leaves office on Jan. 20.\nMr. Trump nullified more of the legal consequences of an investigation into his 2016 campaign that he long labeled a hoax. He granted clemency to contractors whose actions in Iraq set off an international uproar and helped turn public opinion further against the war there. And he pardoned three members of his party who had become high-profile examples of public corruption.\nThe 15 pardons and five commutations were made public by the White House in a statement on Tuesday evening. They appeared in many cases to have bypassed the traditional Justice Department review process — more than half of the cases did not meet the department’s standards for consideration — and reflected Mr. Trump’s long-held grudges about the Russia investigation, his instinct to side with members of the military accused of wrongdoing and his willingness to reward political allies.", "url": "https://www.nytimes.com/2020/12/22/us/politics/trump-pardons.html"}