{"authors": ["Eshe Nelson", "Matt Phillips"], "date_download": "2020-12-28 15:49:12", "date_modify": "2020-12-28 15:49:12", "date_publish": "2020-12-21 10:55:05", "description": null, "filename": "2020_12_21_business_stocks-are-roiled-as-a-fast-spreading-virus-strain-in-britain-overshadows-the-stimulus-deal_1609170552.html", "image_url": "https://static01.nyt.com/images/2020/12/21/business/21economy-briefing-markets/merlin_181522254_043698b2-487e-447b-acd0-7b80bf027503-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_21_business_stocks-are-roiled-as-a-fast-spreading-virus-strain-in-britain-overshadows-the-stimulus-deal_1609170552.html", "title": "Stocks are roiled as a fast-spreading virus strain in Britain overshadows the stimulus deal.", "title_page": "Stocks are roiled as a fast-spreading virus strain in Britain overshadows the stimulus deal. - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "Financial markets were jolted on Monday after the emergence of a fast-spreading coronavirus variant led to the suspension of some trade and travel with Britain as well as another lockdown in London, a new threat that overshadowed progress in Washington toward a long-awaited economic aid package.\nBut after falling sharply at the start of trading, Wall Street’s major benchmarks mostly recovered before ending the day mixed.\nThe Dow Jones industrial average recouped all of its early losses to finish slightly up for the day, and the S&P 500 index declined 0.4 percent, its second straight decline near the end of a tumultuous year.\n“The stimulus deal is a step in the right direction and significantly lowers the odds of a recession in the first quarter,” said Ryan Detrick, chief market strategist for LPL Financial. “Still, massive shutdowns in Europe are a harsh reminder we aren’t out of the woods yet.”", "url": "https://www.nytimes.com/2020/12/21/business/stocks-are-roiled-as-a-fast-spreading-virus-strain-in-britain-overshadows-the-stimulus-deal.html"}