{"authors": ["Dave Itzkoff"], "date_download": "2020-12-28 15:49:05", "date_modify": "2020-12-28 15:49:05", "date_publish": "2020-12-20 08:39:50", "description": "Alex Moffat became the latest “S.N.L.” cast member to portray Biden, following Carrey’s announcement that he was stepping down from the role.", "filename": "2020_12_20_arts_television_snl-joe-biden-jim-carrey-kristen-wiig_1609170545.html", "image_url": "https://static01.nyt.com/images/2020/12/20/arts/20snl/20snl-facebookJumbo-v2.png", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_20_arts_television_snl-joe-biden-jim-carrey-kristen-wiig_1609170545.html", "title": "‘Saturday Night Live’ Finds a New Joe Biden After Jim Carrey Exits", "title_page": "‘Saturday Night Live’ Finds a New Joe Biden After Jim Carrey Exits - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "It was with some fanfare that “Saturday Night Live” announced in the fall that it had recruited Jim Carrey to play former Vice President Joseph R. Biden Jr., then the Democratic presidential nominee and now president-elect. At the time, Lorne Michaels, the “S.N.L.” creator and executive producer, went so far as to say that Carrey’s performance would be “stunning and possibly transcend comedy.”\nBut Carrey’s exit from the role, which he had not played since November, was more subdued. In a tweet posted on Saturday afternoon, Carrey wrote that his time playing Biden “was only meant to be 6 weeks” and that although he considered the assignment to be “comedy’s highest call of duty,” he was “just one in a long line of proud, fighting SNL Bidens!” (As long time viewers know, the part had previously been played by cast members and guest stars including Jason Sudeikis, Woody Harrelson and John Mulaney.)\nAnd by Saturday night, “S.N.L.” had already lined up another cast member, Alex Moffat, to play Biden in the show’s opening sketch.", "url": "https://www.nytimes.com/2020/12/20/arts/television/snl-joe-biden-jim-carrey-kristen-wiig.html"}