{"authors": ["Tariq Panja"], "date_download": "2020-12-28 15:49:08", "date_modify": "2020-12-28 15:49:08", "date_publish": "2020-12-16 17:10:51", "description": "The move follows growing concern about the long-term effects of head injuries and the often-rushed treatment players receive.", "filename": "2020_12_16_sports_soccer_concussion-substitutes-ifab_1609170548.html", "image_url": "https://static01.nyt.com/images/2020/12/16/sports/16concussions2/merlin_181288794_4869d018-f639-4486-a659-4393cd129468-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_16_sports_soccer_concussion-substitutes-ifab_1609170548.html", "title": "Soccer Will Run Trials of Concussion Substitutes", "title_page": "Soccer Will Run Trials of Concussion Substitutes - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "The concussion substitutions approved Wednesday for trial do not appear to be mandatory, and since they said any player’s removal from a game would be “permanent,” they raise the prospect that coaches would continue to be reluctant to remove influential players from key games even if they showed signs of concussions. In the most troubling recent incident, at the 2014 World Cup final, Germany midfielder Christoph Kramer was allowed to play on for 14 minutes despite being visibly disoriented after colliding with an Argentina defender. The match’s referee told reporters that Kramer had asked him during play to confirm that the match really was the World Cup final.\nIn Russia four years later, Morocco’s Noureddine Amrabat made headlines when he was cleared to play in a World Cup group-stage game only five days after he had lost consciousness in his team’s previous game. Morocco’s manager at the time, Hervé Renard, described Amrabat as a “warrior.”\nMore recently, the former Tottenham defender Jan Vertonghen told a Belgian broadcaster that he had played with the effects of a concussion for months after an injury in a 2019 Champions League semifinal. But he said the pressure to perform in the final year of his contract, and to keep his place in Tottenham’s lineup, led him to push aside his serious concerns.\n“I still had a year left on my contract, so I had to play, but when I played, I played badly,” Vertonghen told Belgium’s Sporza TV, adding: “I should not have continued playing; it affected me in total for nine months and that’s why I couldn’t bring what I wanted to on the field.”", "url": "https://www.nytimes.com/2020/12/16/sports/soccer/concussion-substitutes-ifab.html"}