{"authors": ["Liz Alderman"], "date_download": "2020-12-28 15:49:04", "date_modify": "2020-12-28 15:49:04", "date_publish": "2020-12-21 15:25:36", "description": "A plunge in ridership at the international high-speed train mirrors wider troubles gripping Europe’s railway industry.", "filename": "2020_12_21_business_eurostar-pandemic-train-europe_1609170544.html", "image_url": "https://static01.nyt.com/images/2020/12/21/business/21eurostar1/merlin_181082226_db768890-baff-48b5-beee-ea9646e8bd2b-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_21_business_eurostar-pandemic-train-europe_1609170544.html", "title": "Who Takes the Eurostar? Almost No One, as the Pandemic Fuels a Rail Crisis", "title_page": "Who Takes the Eurostar? Almost No One, as the Pandemic Fuels a Rail Crisis - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "PARIS — Earlier this month, David-Alexander Leduc rolled his suitcase down a nearly empty platform at the Gare du Nord train station and scanned his ticket at the turnstile to board the sole Eurostar leaving that day for London.\nMr. Leduc used to shuttle regularly for business on one of at least 17 high-speed Eurostar trains that ran back and forth daily, morning to night, through the underwater Channel Tunnel linking Britain and France.\nHe was lucky there was a train to take.\n“It’s constraining,” said Mr. Leduc, who lives in London and has cut back hopping over to France to meet clients as a plunge in ridership from national quarantines forces Eurostar to slash services. “But you have to adapt.”\nOn Monday, a bad year for Eurostar suddenly turned worse. All service from London to Paris, Brussels and Amsterdam was suspended for at least 48 hours, as governments on the continent banned travelers from Britain, a precaution as health officials try to control a new variant of coronavirus sweeping across parts of England. Trains will continue operating from Paris to London, the company said.", "url": "https://www.nytimes.com/2020/12/21/business/eurostar-pandemic-train-europe.html"}