{"authors": ["Luke Broadwater", "Jesse Drucker", "Rebecca R. Ruiz"], "date_download": "2020-12-28 15:49:06", "date_modify": "2020-12-28 15:49:06", "date_publish": "2020-12-23 02:20:12", "description": "The voluminous coronavirus relief and spending bill that blasted through Congress on Monday includes provisions — good, bad and just plain strange — that few lawmakers got to read.", "filename": "2020_12_22_us_politics_whats-in-the-covid-relief-bill_1609170546.html", "image_url": "https://static01.nyt.com/images/2020/12/24/us/politics/22dc-stimulus-fineprint1/merlin_181389258_2eb1258f-c9aa-4548-bc1c-70a3be15fc76-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_22_us_politics_whats-in-the-covid-relief-bill_1609170546.html", "title": "Buried in Covid Relief Bill: Billions to Soothe the Richest", "title_page": "Buried in Covid Relief Bill: Billions to Soothe the Richest - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "“Members of Congress have not read this bill. It’s over 5000 pages, arrived at 2pm today, and we are told to expect a vote on it in 2 hours,” Representative Alexandria Ocasio-Cortez, Democrat of New York, tweeted on Monday. “This isn’t governance. It’s hostage-taking.”\nSenator Ted Cruz, Republican of Texas, agreed — the two do not agree on much.\n“It’s ABSURD to have a $2.5 trillion spending bill negotiated in secret and then—hours later—demand an up-or-down vote on a bill nobody has had time to read,” he tweeted on Monday.\nThe items jammed into the bill are varied and at times bewildering. The bill would make it a felony to offer illegal streaming services. One provision requires the C.I.A. to report back to Congress on the activities of Eastern European oligarchs tied to President Vladimir V. Putin of Russia. The federal government would be required to set up a program aimed at eradicating the murder hornet and to crack down on online sales of e-cigarettes to minors.\nIt authorizes 93 acres of federal lands to be used for the construction of the Teddy Roosevelt Presidential Library in North Dakota and creates an independent commission to oversee horse racing, a priority of Senator Mitch McConnell, Republican of Kentucky and the majority leader.\nMr. McConnell inserted that item to get around the objections of a Democratic senator who wanted it amended, but he received agreement from other congressional leaders.\nAlexander M. Waldrop, the chief executive of the National Thoroughbred Racing Association, said on Tuesday that Mr. McConnell had “said many times he feared for the future of horse racing and the impact on the industry, which of course is critical to Kentucky.”\nThat the racing legislation — versions of which the industry had debated for years — passed as part of the Covid-19 relief bill was of no particular mind, Mr. Waldrop said.", "url": "https://www.nytimes.com/2020/12/22/us/politics/whats-in-the-covid-relief-bill.html"}