{"authors": ["Sheera Frenkel", "Davey Alba"], "date_download": "2020-12-28 15:49:16", "date_modify": "2020-12-28 15:49:16", "date_publish": "2020-12-22 15:19:36", "description": "The conservative social media personalities who spread baseless rumors of election fraud are starting to focus on the races that will decide control of the Senate.", "filename": "2020_12_22_technology_georgia-senate-runoff-misinformation_1609170556.html", "image_url": "https://static01.nyt.com/images/2020/12/22/business/22georgia-superspreaders/merlin_181252287_a5b1c887-e437-486e-82f1-8bf63d25e0de-facebookJumbo.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/nytimes.com/2020_12_22_technology_georgia-senate-runoff-misinformation_1609170556.html", "title": "Misinformation Amplifiers Target Georgia Senate Races", "title_page": "Georgia Senate Runoff Targeted by Misinformation 'Superspreaders' - The New York Times", "title_rss": "NULL", "source_domain": "nytimes.com", "maintext": "Two weeks ago, the conservative media personalities Diamond and Silk falsely claimed on their Facebook page that people who were not eligible to vote were receiving ballots in Georgia’s special elections next month. Their post was shared more than 300 times.\nA week later, the right-wing commentator Mark Levin shared a post on his Facebook page falsely suggesting that the Rev. Raphael Warnock, one of the two Democrats running in the Georgia Senate runoffs, once welcomed Fidel Castro to his church. The misleading claim was shared more than 3,000 times.\nAt the same time, a drumbeat of misinformation about the presidential election count in Georgia droned on. Lara Trump, President Trump’s daughter-in-law, and the Hodgetwins, a bodybuilding duo who have turned to pro-Trump political comedy, shared several false stories on their Instagram and Facebook pages that claimed suitcases filled with ballots were pulled out from under tables during the November vote count. Tens of thousands of people shared their posts.\nAs Georgia prepares to hold special elections that will determine which party will control the U.S. Senate, the state has become the focus of a misinformation campaign that is aimed at discrediting the results of the November elections and convincing voters that Democrats are trying to steal the upcoming vote.", "url": "https://www.nytimes.com/2020/12/22/technology/georgia-senate-runoff-misinformation.html"}