{"authors": [], "date_download": "2020-12-28 15:49:50", "date_modify": "2020-12-28 15:49:50", "date_publish": "2020-12-10 10:32:18", "description": "Nanjing will host the World Athletics Indoor Championships in 2023 after the 2021 event was postponed because of the ongoing coronavirus pandemic.", "filename": "sport_athletics_55257397_1609170590.html", "image_url": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/7AC4/production/_115982413_gettyimages-926410300.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/bbc.com/sport_athletics_55257397_1609170590.html", "title": "World Athletics Indoor Championships postponed", "title_page": "World Athletics Indoor Championships postponed - Nanjing to host in 2023 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Last updated on .From the section Athletics\nKatarina Johnson-Thompson won gold in the pentathlon at the 2018 World Athletics Indoor Championships in Birmingham\nNanjing will host the World Athletics Indoor Championships in 2023 after the 2021 event was postponed because of the ongoing coronavirus pandemic.\nThe Chinese city had been scheduled to host the Championships in March 2020 but that was pushed back to 2021.\nNanjing will now host the event one year after the next World Indoor Championships in Belgrade in 2022.\n\"We must fully respect and carry out the pandemic prevention policy of the host country,\" said World Athletics.\n\"We must consider the risks in bringing a large group of people to attend the event under the pandemic situation.\n\"The indoor season for athletics falls within a narrow calendar window (up to the end of March) so it is not possible to extend the event to later in the year.\"\nThe event is usually biennial and was last held in Birmingham in 2018, where Great Britain won two gold medals.\nThe next World Athletics indoor event is scheduled to be the World Indoor Tour which begins in Karlsruhe, Germany on 29 January.", "url": "https://www.bbc.com/sport/athletics/55257397"}