{"authors": [], "date_download": "2020-12-28 15:49:26", "date_modify": "2020-12-28 15:49:26", "date_publish": "2020-12-19 23:59:50", "description": "Former England captain Alan Shearer says he would \"not be so sure\" about Arsenal surviving in the Premier League at the end of the season.", "filename": "sport_football_55382530_1609170566.html", "image_url": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/10FAC/production/_116184596_ceballos-index.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/bbc.com/sport_football_55382530_1609170566.html", "title": "Alan Shearer would 'not be so sure' about Arsenal staying in Premier League", "title_page": "Alan Shearer would 'not be so sure' about Arsenal staying in Premier League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Last updated on .From the section Arsenal\nFormer England captain Alan Shearer says he would \"not be so sure\" about Arsenal's chances of Premier League survival at the end of this season.\nThe Gunners have made their worst start to a season since the 1974-75 campaign and lie 15th in the table.\nThey have 14 points from 14 games and have lost eight of those matches.\nAsked if they will stay up, Shearer replied: \"I wouldn't be so sure. Not with that starting team and the attitude of some of those players.\"\nThe 2-1 defeat against Everton at Goodison Park on Saturday left Mikel Arteta's side four points above the relegation zone.\nThe Gunners have not scored from open play in any of their past five top-flight games away from home.\nNicolas Pepe, the club's record £72m signing, scored just his second league goal of the season from the penalty spot.\nArsenal players still have belief - Arteta\nShearer added on Match of the Day: \"Awful, no creativity, players going through the motions, not working hard enough and not closing down.\n\"Mikel Arteta should be a worried man relying on that group of players trying to save his job. Twelve goals all season, they have no options.\n\"Against Everton, Pepe was not prepared to get into the box, he was jogging, sometimes walking. He has got to do more.\n\"There are a few players in that team who are not giving everything for the manager. Arsenal are never going to score goals playing like that.\"\nArteta admitted Arsenal \"are in a big fight\" and the players \"hurt right now\".\nThe Spaniard added: \"We need to generate more to win football matches. When it comes to small details, the other team wants it more. The boys are absolutely still fighting.\n\"The way the boys reacted in the dressing room tells me they have the belief. When you lose lots of games for different reasons it hurts a lot.\n\"We have to be better, it wasn't about Everton, it was about us.\"", "url": "https://www.bbc.com/sport/football/55382530"}