{"authors": [], "date_download": "2020-12-28 15:49:36", "date_modify": "2020-12-28 15:49:36", "date_publish": "2020-12-21 11:52:34", "description": "Lee Westwood is named 2020 European Tour Golfer of the Year, winning the award for the fourth time.", "filename": "sport_golf_55395828_1609170576.html", "image_url": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/7769/production/_116196503_gettyimages-1290996573.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/bbc.com/sport_golf_55395828_1609170576.html", "title": "Lee Westwood named 2020 European Tour Golfer of the Year", "title_page": "Lee Westwood named 2020 European Tour Golfer of the Year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Last updated on .From the section Golf\nWestwood won a third Race to Dubai title this month\nLee Westwood has been named 2020 European Tour Golfer of the Year.\nIt is the fourth time the 47-year-old Englishman has won the award.\nWestwood began the year with victory at the Abu Dhabi Championship in January, and ended it by winning the Race to Dubai after finishing runner-up to Matt Fitzpatrick in the DP World Tour Championship this month.\nThe 10-time Ryder Cup player also hosted the British Masters for the second time at Close House in July.\nThe tournament marked the full resumption of the European Tour's 2020 season following a three month pause because of the coronavirus pandemic.\nWestwood was previously crowned European number one in 2000 and 2009, with the span of 20 years between his first and most recent Harry Vardon Trophy surpassing the previous record of 15 years held by Seve Ballesteros.\nHis longevity was further underlined by the fact he also became the oldest winner of the Race to Dubai at the age of 47 years, seven months and 20 days.\n\"I am very honoured and extremely flattered to have been named European Tour Golfer of the Year as I know the competition for the award this year would have been extremely high,\" Westwood said.\n\"Thank you to the media for voting for me and also huge congratulations again to everyone at the European Tour who did a tremendous job this year managing to put on a full international schedule under such difficult times.\n\"I never forget that I am extremely fortunate to do a job which I love, and which has sent me around the world playing in the most amazing places and meeting some wonderful people, so to win this award is very humbling.\"\nKeith Pelley, chief executive officer of the European Tour, said: \"Lee has been an incredible ambassador for golf and for the European Tour, not just throughout 2020 but also across his entire career.\n\"His performances and his professionalism are matched by his longevity and his commitment to European golf.\"", "url": "https://www.bbc.com/sport/golf/55395828"}