{"authors": [], "date_download": "2020-12-28 15:50:00", "date_modify": "2020-12-28 15:50:00", "date_publish": "2020-12-17 00:07:30", "description": "Britain's Chris Froome will make his debut for Israel Start-Up Nation in January's Vuelta San Juan in Argentina.", "filename": "sport_cycling_55337877_1609170600.html", "image_url": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/6D3A/production/_116126972_chrisfroome.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/bbc.com/sport_cycling_55337877_1609170600.html", "title": "Chris Froome: Israel Start-Up Nation newcomer to make debut in Vuelta San Juan", "title_page": "Chris Froome: Israel Start-Up Nation newcomer to make debut in Vuelta San Juan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Last updated on .From the section Cycling\nFroome's last race win was the 2018 Giro d'Italia\nBritain's Chris Froome will make his debut for Israel Start-Up nation in January's Vuelta San Juan in Argentina.\nThe four-time Tour de France winner joined the team after Ineos Grenadiers decided not to renew his contract last July.\nFroome struggled for form last season following injury in 2019 and was not selected for this year's Tour.\n\"This will mark the beginning of a much-anticipated new chapter of my career,\" said Froome, 35.\nThe eight-day race is one of the first major competitions of 2021 following the cancellation of the Tour Down Under in Australia.\nFroome, who began racing for Ineos (formerly Team Sky) in 2009, is still searching for the form which earned him seven Grand Tour victories between 2011 and 2018.\nA crash during the 2019 Criterium de Dauphine caused him to suffer multiple fractures, threatening his career.\nHe was not selected for this year's Tour, with Ineos preferring 2019 Tour winner Egan Bernal, who abandoned the race before stage 17 after losing more than seven minutes on stage 15.\nIsrael Start-Up Nation, who have been a World Tour outfit since 2020, have signed Froome on a \"multi-year\" contract.\nThe team's new sporting director, Rik Verbrugghe, said Froome is \"not going to Argentina to win the race\".\n\"We see it as a perfect opportunity for Chris to start the building process towards the peak of the season down the road,\" he said.\nFroome contested his final race for Ineos in last month's Vuelta a Espana. He finished 98th, but helped Richard Carapaz to second.", "url": "https://www.bbc.com/sport/cycling/55337877"}