{"authors": [], "date_download": "2020-12-28 15:49:43", "date_modify": "2020-12-28 15:49:43", "date_publish": "2020-12-22 17:34:27", "description": "Andy Murray continues in promising form at the Battle of the Brits, beating Cameron Norrie in straight sets.", "filename": "sport_tennis_55416994_1609170583.html", "image_url": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/36B2/production/_116220041_gettyimages-1292597260.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/bbc.com/sport_tennis_55416994_1609170583.html", "title": "Andy Murray beats Cameron Norrie at Battle of the Brits", "title_page": "Andy Murray beats Cameron Norrie at Battle of the Brits - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Last updated on .From the section Tennis\nAndy Murray returned to tennis in June 2019 following career-saving hip surgery the previous January\nAndy Murray continued in promising form at the Battle of the Brits, beating Cameron Norrie in straight sets.\nThe world number 122 claimed victory against British number one Dan Evans on Sunday and two days later beat Norrie 6-4 7-6 (7-5).\nBefore the tournament in London, the 33-year-old had not played since withdrawing from a Cologne event in October because of a pelvic problem.\nThe all-British event is taking place in Roehampton.\nNorrie started slowly and Murray took advantage to seal the first set, before Norrie fought back to take the second to a tie-break.\nThe British number three had a set point at 6-5 but Murray saved it and sealed victory as his lob landed perfectly on the baseline.\nEvans bounced back from his defeat to Murray, beating beating Liam Broady 6-0 6-2, while Jack Draper followed up Monday's victory over Norrie with a 6-4 6-1 success against Jay Clarke.\nThere were also wins for Anton Matusevich, Katy Dunne, Francesca Jones and Eden Silva.\nThe Battle of the Brits was organised by the Lawn Tennis Association to help British players prepare for the 2021 season with competitive matches after their schedules had been affected by the coronavirus pandemic.", "url": "https://www.bbc.com/sport/tennis/55416994"}