{"authors": ["Marianne Garvey"], "date_download": "2020-12-28 15:48:39", "date_modify": "2020-12-28 15:48:39", "date_publish": "2020-12-22 15:05:30", "description": "Chris Pratt appears to have won the latest round in the battle over which Chris is the best Hollywood Chris.", "filename": "2020_12_22_entertainment_ch_990e2b26aa58747eee5c72728fa9c08f_index_1609170519.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/201021080130-chris-pratt-0218-super-tease.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/edition.cnn.com/2020_12_22_entertainment_ch_990e2b26aa58747eee5c72728fa9c08f_index_1609170519.html", "title": "Chris Pratt announces 'better Chris' victories over Chris Evans and Chris Hemsworth", "title_page": "Chris Pratt announces 'better Chris' victories over Chris Evans and Chris Hemsworth - CNN", "title_rss": "NULL", "source_domain": "edition.cnn.com", "maintext": "(CNN) Chris Pratt appears to have won the latest round in the battle over which Chris is the best Hollywood Chris.\nThe \"Guardians of the Galaxy\" star took to social media Monday to share about his winning record in a charity fantasy football league in which he competes with Chris Evans and Chris Hemsworth, called The AGBO Superhero League.\n\"My fantasy football team in AGBO fantasy football league, if you've been following -- I made it into the finals!\" Pratt said on an Instagram Story, adding \"I'm in the finals! How did this happen?\"\nWe need a big day tomorrow! Just like the @SpecialOlympics motto declares, \"Let me win, but if I cannot win let me be brave in the attempt.\"\nWe had the 14th round draft pick and we made it all the way to the semi finals! https://t.co/kYFRhUkQ3P — chris pratt (@prattprattpratt) December 20, 2020\nPratt added that he earned $80,000 for his charity, Special Olympics Washington.\n\"It's a 14-man league,\" he explained. \"I had 14th draft pick. You know how hard that is? I was picked last. It was very traumatic. Anyone who's been picked last knows how that feels.\"\nRead More", "url": "https://edition.cnn.com/2020/12/22/entertainment/chris-pratt-chris-evans-chris-hemsworth/index.html"}