{"authors": ["Priscilla Alvarez"], "date_download": "2020-12-28 15:48:50", "date_modify": "2020-12-28 15:48:50", "date_publish": "2020-12-22 21:07:18", "description": "Just weeks after a federal court ordered that Deferred Action for Childhood Arrivals be restored, a judge in Texas heard arguments in a case challenging the legality of the program, which shields hundreds of thousands of undocumented immigrants who came to the US as children from deportation.", "filename": "2020_12_22_politics_daca-texas_index_1609170530.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/201114182513-01-daca-protests-file-june-2020-super-tease.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/edition.cnn.com/2020_12_22_politics_daca-texas_index_1609170530.html", "title": "Federal judge in Texas weighs legality of DACA, putting the program at risk again", "title_page": "Federal judge in Texas weighs legality of DACA, putting the program at risk again  - CNNPolitics", "title_rss": "NULL", "source_domain": "edition.cnn.com", "maintext": "(CNN) Just weeks after a federal court ordered that Deferred Action for Childhood Arrivals be restored , a judge in Texas heard arguments in a case challenging the legality of the program, which shields hundreds of thousands of undocumented immigrants who came to the US as children from deportation.\nThe case before Judge Andrew Hanen on Tuesday, brought by Texas and a coalition of states in 2018, marks the latest twist in years of legal back-and-forth over the Obama-era program.\nThe Trump administration tried ending DACA in 2017, but the US Supreme Court blocked its attempt in June. In light of the Supreme Court ruling, acting Homeland Security Secretary Chad Wolf issued a memo that said new applications for DACA would not be accepted and renewals would be limited to one year instead of two amid an ongoing review.\nBut a separate federal judge recently found Wolf's memo invalid and ordered the restoration of the program , providing a brief reprieve to its recipients and those who are eligible to apply but were barred from doing so due to the new rules.\nHanen has previously indicated where he stands on the issue. In 2018, he said he believed DACA is likely illegal and ultimately will fail to survive a challenge before his court, but allowed the program to go forward.\nTexas -- along with Alabama, Arkansas, Louisiana, Nebraska, South Carolina and West Virginia -- argued in the initial complaint that the program placed an undue burden on the states and amounted to executive overreach.\n\"There's simply no reason to exercise additional delay in this case,\" Todd Lawrence Disher, representing Texas, said Tuesday. \"This court is being asked to rule on the 2012 memorandum that created the DACA program. There is no additional reason now to delay. That program was unlawful at its inception and it continues to be unlawful today.\"\nOver the course of the nearly four-hour hearing, Hanen pressed attorneys over whether the program does indeed circumvent immigration law.\n\"What do I do with the fact that, in theory, if there's no DACA, all the DACA recipients are removable aliens and presumably should be removed if they're following the INA, if the government follows the INA?\" Hanen asked, referring to the Immigration Nationality Act.\nThe vice president of litigation for the Mexican American Legal Defense and Educational Fund, Nina Perales, arguing on behalf of DACA recipients, noted that beneficiaries of the program could still be removable, given that the program is not a legal status.\nNew Jersey is also part of the litigation, in support of the initiative.\nAttorneys arguing in support of DACA also threw cold water on the argument that the program imposes additional costs on states, saying that instead, rescinding DACA would likely impose harm on the states' economies. Disher maintained that the court \"must set aside the DACA program.\" Neither party urged for the immediate termination of DACA.\nHanen did not indicate when he might rule in the case.", "url": "https://edition.cnn.com/2020/12/22/politics/daca-texas/index.html"}