{"authors": ["Michelle Toh", "Cnn Business"], "date_download": "2020-12-28 15:48:55", "date_modify": "2020-12-28 15:48:55", "date_publish": "2020-12-03 05:47:52", "description": "The world has been inching toward fully autonomous cars for years. In China, one company just got even closer to making it a reality.", "filename": "2020_12_03_tech_autox-robotaxi-china-intl-hnk_index_1609170535.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/201202134709-autox-driverless-fleet-super-tease.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/edition.cnn.com/2020_12_03_tech_autox-robotaxi-china-intl-hnk_index_1609170535.html", "title": "Self-driving robotaxis are taking off in China", "title_page": "Self-driving robotaxis are taking off in China - CNN", "title_rss": "NULL", "source_domain": "edition.cnn.com", "maintext": "Hong Kong (CNN Business) The world has been inching toward fully autonomous cars for years . In China, one company just got even closer to making it a reality.\nOn Thursday, AutoX, an-backed startup, announced it had rolled out fully driverless robotaxis on public roads in Shenzhen. The company said it had become the first player in China to do so, notching an important industry milestone.\nPreviously, companies operating autonomous shuttles on public roads in the country were constrained by strict caveats, which required them to have a safety driver inside.\nThis program is different. In Shenzhen, AutoX has completely removed the backup driver or any remote operators for its local fleet of 25 cars, it said. The government isn't restricting where in the city AutoX operates, though the company said they are focusing on the downtown area.\nThe company released a video of its minivan — the Fiat Chrysler Pacifica — navigating on its own through the city's downtown area, showing passengers getting in, loading a package into the backseat and letting a dog hop in for a spin.\nIt also depicts the car navigating around loading trucks, veering past pedestrians, and performing a U-turn.\nAutoX demonstrating its driverless robotaxis on the roads in Shenzhen. Credit: AutoX\n\"It's a dream,\" AutoX CEO Jianxiong Xiao said in an interview. \"After working so hard for so many years, we've finally reached the point that the technology is mature enough, that we feel confident by ourselves, to really remove the safety driver.\"\nXiao said the company won over regulators after working to improve both its software and hardware. \"We have over 100 vehicles driving every day on the road [in China] to capture data,\" he said. \"The AI software is better [now.]\"\n\"From a technical point of view, the car is ready,\" Xiao said. \"It's very crucial to have this car, otherwise we cannot go driverless.\"\nAutoX was founded in 2016 by Xiao, a former assistant lecturer at Princeton who still likes to be called \"Professor X.\" The Shenzhen-based firm focuses on making the technology that goes into self-driving cars, and partners with major automakers, such as Fiat Chrysler, to develop and put out its robotaxis.\nThe new initiative is still in trial mode and not currently open to the public. That likely won't change anytime soon, according to Xiao, who said that he hoped to obtain permission to expand the program to regular passengers in the next two or three years.\nRace of the robotaxi\nWhile AutoX has claimed an edge in China, it's not the first time fully driverless shuttles have hit public roads. This summer, the company obtained approval to carry out completely autonomous tests on public roads in parts of San Jose, California, clearing another hurdle in one of its most important markets.\nIn October, Alphabet's Waymo went a step further, saying that it would start opening up its unmanned transportation service to members of the public in Phoenix, Arizona. (It now offers rides to passengers in the area through an app.)\nDomestic competition is also heating up. Recently, Chinese companies have started to let more ordinary people experience what it's like to ride in a self-driving car.\nThis year, the coronavirus pandemic demonstrated the need for contactless services, which encouraged the government to move faster with autonomous technology, said Xiao.\nIn June, Didi, China's biggest ride-hailing firm, began offering free rides in its autonomous vehicles within a designated area of Shanghai.\nBaidu BIDU Recently, Chinese tech giantalso announced that anyone could try its robotaxi service in certain districts of Beijing. Both of those programs require dedicated safety drivers.\nAutoX already has more than 100 robotaxis deployed in five Chinese cities, including Shanghai and Wuhan. Over the next year, it aims to double its reach to more than 10 local cities. Whether the company can pull humans from behind the wheel in other markets depends on local regulators, Xiao said.\nIn Shanghai, its vehicles are available to public users, who can hail them through Alibaba's Autonavi app, a Chinese mapping app.\nThe startup's latest approval from local authorities in Shenzhen came after six months of trials it had already conducted there.\nSome of the company's lessons so far include how to better adapt to traffic conditions in each place, according to Xiao. In Shenzhen, for instance, motorists often have to watch out for delivery workers on bikes and scooters, and drivers are known to drive more aggressively than in the United States, he said.\n\"The traffic scenarios are much more challenging,\" he added. \"For our AI, we had to do a lot of work to adapt to the local Chinese way of driving.\"\nChina, home to the world's biggest auto sector, could someday become the top global market for automated vehicles, according to a report from consulting firm McKinsey. It projects the country could generate as much as $1.1 trillion in revenue from autonomous mobility services by 2040.\nThe industry, however, still faces a long road ahead. Xiao estimates it could take another five years for unmanned taxis to become the norm across China.\n\"The bar is incredibly high,\" he said. \"It's extremely challenging, but we're very happy.\"", "url": "https://edition.cnn.com/2020/12/03/tech/autox-robotaxi-china-intl-hnk/index.html"}