{"authors": ["Kate Sullivan", "Jeff Zeleny"], "date_download": "2020-12-28 15:48:44", "date_modify": "2020-12-28 15:48:44", "date_publish": "2020-12-22 19:24:57", "description": "President-elect Joe Biden on Tuesday said the \"darkest days\" in the battle against the coronavirus pandemic \"are ahead of us, not behind us,\" and urged Americans to prepare themselves for the struggle.", "filename": "2020_12_22_politics_biden-holiday-remarks_index_1609170524.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/201222145820-01-biden-holiday-remarks-1222-super-tease.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/edition.cnn.com/2020_12_22_politics_biden-holiday-remarks_index_1609170524.html", "title": "Biden says 'our darkest days' in battling Covid-19 'are ahead of us'", "title_page": "President-elect Joe Biden says 'our darkest days' in battling Covid-19 'are ahead of us' - CNNPolitics", "title_rss": "NULL", "source_domain": "edition.cnn.com", "maintext": "(CNN) President-elect Joe Biden on Tuesday said the \"darkest days\" in the battle against the coronavirus pandemic \"are ahead of us, not behind us,\" and urged Americans to prepare themselves for the struggle.\n\"One thing I promise you about my leadership during this crisis: I'm going to tell it to you straight. I'm going to tell you the truth. And here's the simple truth: Our darkest days in the battle against Covid are ahead of us, not behind us,\" Biden said in remarks in Wilmington, Delaware.\n\"So we need to prepare ourselves, to steel our spines,\" the President-elect continued. \"As frustrating as it is to hear, it's going to take patience, persistence and determination to beat this virus. There will be no time to waste in taking the steps we need to turn this crisis around.\"\nBiden said that in addition to acting swiftly to provide more economic relief and support to Americans, his administration will urgently address the recent massive cyberattack on US companies and federal government agencies.\n\"There's still so much we don't know, including the full scope of the breach or the extent of the damage it has caused. But we know this much: This attack constitutes a grave risk to our national security,\" Biden said, in his most extensive comments on the matter to date.\nRead More", "url": "https://edition.cnn.com/2020/12/22/politics/biden-holiday-remarks/index.html"}