{"authors": ["Anneken Tappe", "Cnn Business"], "date_download": "2020-12-28 15:48:40", "date_modify": "2020-12-28 15:48:40", "date_publish": "2020-12-21 14:34:40", "description": "It was a bumpy ride for the Dow and US stocks on Monday as worries over a new variant of the coronavirus overshadowed the news of a second pandemic relief bill.", "filename": "2020_12_21_investing_dow-stock-market-today-coronavirus_index_1609170520.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/201221090026-nyse-1217-restricted-super-tease.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/edition.cnn.com/2020_12_21_investing_dow-stock-market-today-coronavirus_index_1609170520.html", "title": "Stocks and oil prices sink as new coronavirus variant sends Europe into lockdown", "title_page": "Dow, US stocks and oil prices sink as new coronavirus variant sends Europe into lockdown - CNN", "title_rss": "NULL", "source_domain": "edition.cnn.com", "maintext": "New York (CNN Business) It was a bumpy ride for US stocks on Monday as worries over a new variant of the coronavirus overshadowed the news of a second pandemic relief bill that was agreed to in Washington late Sunday.\nDow INDU S&P 500 SPX Nasdaq Composite COMP The market finished mixed, with theclosing 0.1%, or 37 points, higher, while the broaderended down 0.4%. Theclosed 0.1% lower.\nIt was a turbulent session. The three indexes started the trading day sharply lower before pulling back from their worst losses. The Dow turned modestly positive in the afternoon.\nIt's a shortened week for the market, which will end trading on Thursday at 1 pm ET for the Christmas holiday. Trading volumes are lower with the holiday approaching, which means that market moves tend to be exaggerated, making Monday's selloff look more like panic selling than it really is, said Edward Moya, senior analyst at Oanda.\nEven so, there's reason for investors' worries: Dozens of countries across Europe, the Middle East and the Americas have announced travel bans for the United Kingdom, where the new coronavirus variant has been identified. The variant is thought to be more infectious, which could deliver a blow to the fragile economic recovery following the spring lockdowns around the world.\nRead More", "url": "https://edition.cnn.com/2020/12/21/investing/dow-stock-market-today-coronavirus/index.html"}