{"authors": ["Analysis Brian Lowry"], "date_download": "2020-12-28 15:48:35", "date_modify": "2020-12-28 15:48:35", "date_publish": "2020-12-21 15:15:14", "description": "Hollywood studios and movie theaters spent much of the spring and summer engaged in a strange chess match, trying to find the right time to launch two aspiring blockbusters, \"Tenet\" and \"Mulan,\" which might jumpstart movie-going amid a pandemic.", "filename": "2020_12_21_entertainment_movies-2020-column_index_1609170515.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200724152735-tenet-movie-still-super-tease.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/edition.cnn.com/2020_12_21_entertainment_movies-2020-column_index_1609170515.html", "title": "Movies 2020: With 'Tenet' and 'Mulan,' theaters never had a fighting chance", "title_page": "Movies 2020: With 'Tenet' and 'Mulan,' theaters never had a fighting chance - CNN", "title_rss": "NULL", "source_domain": "edition.cnn.com", "maintext": "(CNN) Hollywood studios and movie theaters spent much of the spring and summer engaged in a strange chess match, trying to find the right time to launch two aspiring blockbusters, \"Tenet\" and \"Mulan,\" which might jumpstart movie-going amid a pandemic.\nYet while both movies contain plenty of fights, with the benefit of hindsight neither of them gave the theater chains a fighting chance.\nDespite marquee elements seemingly designed for blockbuster glory, each of these big-budgeted films came with handicaps in terms of its box-office drawing power. In that sense, the question of whether people could be lured to theaters despite public-health concerns was never fully tested, in the way it would have been if a project without those built-in speed bumps had been thrown into the breach.\nReleased by Warner Bros. (a unit of WarnerMedia, as is CNN), \"Tenet\" did premiere theatrically, performing reasonably well internationally -- $300 million is nothing to sneeze at, unless you're hoping to make a lot more than that -- but generating less than $60 million in the US.\n'Tenet'\nDisney, for its part, ultimately opted for a domestic streaming debut of \"Mulan\" at a premium surcharge via Disney+, coupled with an international release. Yet the movie flopped in China, where the local population exhibited a demonstrable preference for home-grown movies, including one that also dealt with a period story about the Chinese battling a foreign invader, the 1930s epic \"The Eight Hundred.\"\nRead More", "url": "https://edition.cnn.com/2020/12/21/entertainment/movies-2020-column/index.html"}