{"authors": ["Michelle Toh", "Cnn Business"], "date_download": "2020-12-28 15:48:59", "date_modify": "2020-12-28 15:48:59", "date_publish": "2020-12-18 14:09:19", "description": "Alibaba says that it has stopped trying to identify faces by ethnicity after the company was accused this week of creating a facial recognition system meant to detect Uyghurs.", "filename": "2020_12_18_tech_alibaba-cloud-ipvm-uyghurs-intl-hnk_index_1609170539.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/201217232153-alibaba-group-hangzhou-1120-restricted-super-tease.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/edition.cnn.com/2020_12_18_tech_alibaba-cloud-ipvm-uyghurs-intl-hnk_index_1609170539.html", "title": "Alibaba 'dismayed' by reports its software was used to identify Uyghurs", "title_page": "Alibaba 'dismayed' by reports its software was used to identify Uyghurs - CNN", "title_rss": "NULL", "source_domain": "edition.cnn.com", "maintext": "Hong Kong (CNN Business) Alibaba (BABA) says that it has stopped trying to identify faces by ethnicity after the company was accused this week of creating a facial recognition system meant to detect Uyghurs.\nThe Chinese tech company released its statement after The New York Times and IPVM , a surveillance industry publication, reported that a division of Alibaba showed its clients how they could use its technology to identify members of the Uyghur community in videos and images.\nin an algorithm, according to the The system was built by Alibaba's cloud computing team, and allegedly included the example: \"Is this a Uyghur?\"in an algorithm, according to the report . It also reportedly included code to recognize if someone was a \"minority\" or \"Asian.\"\nIn a statement Thursday, Alibaba said that it was \"dismayed to learn that Alibaba Cloud developed a facial recognition technology in a testing environment that included ethnicity as an algorithm attribute for tagging video imagery.\"\nAlibaba did not mention Uyghurs in its statement, or explain how or why the system was built in the first place. But it stressed that the technology had been limited to trials, and \"was not deployed by any customer.\"", "url": "https://edition.cnn.com/2020/12/18/tech/alibaba-cloud-ipvm-uyghurs-intl-hnk/index.html"}