{"authors": ["Kate Sullivan"], "date_download": "2020-12-28 15:48:46", "date_modify": "2020-12-28 15:48:46", "date_publish": "2020-12-23 02:41:22", "description": "President-elect Joe Biden's transition team has criticized Twitter's decision to not allow the millions of followers of the White House Twitter accounts to be automatically retained when the accounts are handed over to the new administration.", "filename": "2020_12_22_politics_biden-twitter-white-house-accounts_index_1609170526.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/201120183709-twitter-biden-trump-potus-super-tease.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/edition.cnn.com/2020_12_22_politics_biden-twitter-white-house-accounts_index_1609170526.html", "title": "Biden team slams Twitter over plan to wipe followers from White House accounts", "title_page": "Biden team slams Twitter over plan to wipe followers from White House accounts - CNNPolitics", "title_rss": "NULL", "source_domain": "edition.cnn.com", "maintext": "(CNN) President-elect Joe Biden's transition team has criticized Twitter's decision to not allow the millions of followers of the White House Twitter accounts to be automatically retained when the accounts are handed over to the new administration.\n\"Twitter's reluctance to transfer millions of followers from the Trump Administration to the Biden Administration unnecessarily politicizes what otherwise should be a routine transfer of communication from one administration to the next,\" Biden-Harris transition spokesperson Cameron French told CNN in a statement on Wednesday.\nWhen President Donald Trump took office in 2017, his administration inherited the millions of followers of each account handed over from the Obama administration. It was the first Twitter transfer of power in US history , and at the time, the @POTUS accounts and @WhiteHouse each had more than 13 million followers.\nNearly four years later, the @POTUS and @WhiteHouse accounts have 33.2 million and 26 million followers, respectively. Trump, a famously prolific tweeter, will retain control of his personal Twitter account, @realDonaldTrump, which has 88.5 million followers on the platform.\n\"The Obama-Biden Administration built out social media accounts and followings that were handed over to the Trump Administration immediately and fully upon taking office. This wasn't about politics, it was about ensuring no disruption in the ability of the executive branch of government to directly communicate its policies to the country,\" French said in the statement.\nRead More", "url": "https://edition.cnn.com/2020/12/22/politics/biden-twitter-white-house-accounts/index.html"}