{"authors": ["Ben Morse"], "date_download": "2020-12-28 15:48:51", "date_modify": "2020-12-28 15:48:51", "date_publish": "2020-12-23 09:49:09", "description": "The sight of Los Angeles Lakers players receiving their NBA Championship rings isn't an uncommon one -- it has happened 16 times before. But the Lakers' latest ring ceremony was like no other.", "filename": "2020_12_23_sport_los-angele_e939d7fdd649ceca88da859c1c85b3bc_index_1609170531.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/201223094635-lebron-james-lakers-ring-tease-super-tease.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/edition.cnn.com/2020_12_23_sport_los-angele_e939d7fdd649ceca88da859c1c85b3bc_index_1609170531.html", "title": "NBA: LA Lakers receive Championship rings -- and then lose their season opener", "title_page": "NBA: LA Lakers receive Championship rings -- and then lose their season opener - CNN", "title_rss": "NULL", "source_domain": "edition.cnn.com", "maintext": "(CNN) The sight of Los Angeles Lakers players receiving their NBA Championship rings isn't an uncommon one -- it has happened 16 times before. But the Lakers' latest ring ceremony was like no other.\nThe LA team had chosen to wait until they could return before hoisting their 17th championship banner. Ring ceremonies are usually raucous affairs, but Tuesday's celebration was a tamer one due to the absence of fans.\nPresident of the Lakers Jeanie Buss told the fans everyone was feeling their absence: \"We miss you. ... But someday soon we will be together.\"\nLeBron James reacts as he gets his 2019-20 NBA Championship ring during the ring ceremony.\nDespite it being an all-but-empty Staples Centre, players were presented with their rings by family on the videoboard. James, in addition to his family, saw to his delight children from his I Promise School congratulating him. Lakers superfan and rapper Snoop Dogg also asked LeBron James if the Lakers will win their 18th title in his 18th year in the league.\nRead More", "url": "https://edition.cnn.com/2020/12/23/sport/los-angeles-lakers-clippers-ring-ceremony-nba-championship-spt-intl/index.html"}