{"authors": ["Julia Horowitz", "Mark Thompson", "Cnn Business"], "date_download": "2020-12-28 15:48:32", "date_modify": "2020-12-28 15:48:32", "date_publish": "2020-12-21 15:25:17", "description": "France has suspended transport links with Britain after a new Covid-19 variant emerged in southern England, adding to growing chaos at UK ports and giving the country a taste of the potential disruption to food and other vital supplies that could accompany a \"no-deal\" Brexit in just 10 days' time.", "filename": "2020_12_21_business_uk-ports-covid-brexit-shortages_index_1609170512.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/201221095849-uk-parked-lorries-dover-port-1221-super-tease.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/edition.cnn.com/2020_12_21_business_uk-ports-covid-brexit-shortages_index_1609170512.html", "title": "Brexit: Covid-19 isolation gives Britain a taste of no-deal chaos", "title_page": "Brexit: Covid-19 isolation gives Britain a taste of no-deal chaos - CNN", "title_rss": "NULL", "source_domain": "edition.cnn.com", "maintext": "London (CNN Business) France has suspended transport links with Britain after a new Covid-19 variant emerged in southern England, adding to growing chaos at UK ports and giving the country a taste of the potential disruption to food and other vital supplies that could accompany a \"no-deal\" Brexit in just 10 days' time.\nDozens of countries in Europe and around the world have halted flights from the United Kingdom, and the French government announced a 48-hour ban on truckers using ferry and rail routes from England to France after a potentially highly-infectious coronavirus mutation was blamed for a Christmas lockdown in London and the surrounding areas.\nUK supermarkets and supply chain experts warned of potential shortages of some products if the French restrictions aren't eased soon. The UK government held a crisis meeting Monday.\nSupermarkets warn of gaps\nOne major supermarket chain,, said it had stockpiled enough produce to prevent Brits going without their Christmas dinners but warned of shortages of some fresh fruit and vegetables if the situation doesn't improve soon.\n\"If nothing changes, we will will start to see gaps over the coming days on lettuce, salad leaves, cauliflowers, broccoli, citrus fruit — all of which are imported from EU at this time of year,\" Sainsbury's said in a statement. \"We hope UK and French [governments] can come to a solution that prioritizes immediate passage of produce and food.\"\nTesco TSCDY said on Monday that \"there may be reduced supply on a few fresh items, such as lettuce, cauliflower and citrus fruit later this week, but we don't expect any problems with availability on these lines today or tomorrow,\" Reuters reported.\nPrime Minister Boris Johnson sought to assuage public fears in a press conference Monday, saying he had spoken with French President Emmanuel Macron and that both sides were working toward a quick resolution.\nHe stressed that British supermarket supply chains are \"strong and robust,\" and that the \"vast majority of food and medicine supplies are coming and going as normal.\"\nThe industry that operates frozen and chilled storage facilities and temperature-controlled vehicles said there was no reason for shoppers to panic, given the UK food supply chain was well stocked for the peak holiday period.\n\"As we learnt in March, the biggest cause of products running out on the shelves will be unnecessary and excessive buying,\" said Cold Chain Federation Chief Executive Shane Brennan. \"We urge everyone to play their part and buy only what they genuinely need.\"\nJanuary could be worse\nBut \"urgent agreements\" were needed between the United Kingdom and EU governments if problems were to be avoided in the new year. \"An extended period of stopped movement now will cause significant problems for supply chains in January,\" Brennan added.\nThat sentiment was echoed by the British Retail Consortium, which represents over 170 major retailers plus thousands of smaller businesses.\n\"Retailers have stocked up on goods ahead of Christmas which should prevent immediate problems,\" said Andrew Opie, director of food and sustainability at the British Retail Consortium. \"However, any prolonged closure of the French border would be a problem as the UK enters the final weeks before the [Brexit] transition ends on [Dec. 31].\"\nUK ports were already under serious strain before the new coronavirus variant sparked chaos at the border.\nThe United Kingdom left the European Union earlier this year but has continued to enjoy free trade with the EU market of 450 million people under transitional arrangements that expire on Dec. 31. Talks on a new agreement to avoid tariffs and quotas on about half of Britain's foreign trade remained deadlocked over the weekend, and the risk that Brexit will end without a trade deal remains high.\nStockpiling ahead of the end of the Brexit transition period and an increase in orders over the Christmas holiday created huge logjams in recent days. Last week, CNN journalists witnessed trucks backed up for more than 10 miles on the approach to the port of Dover, with truckers reporting waits of multiple hours.\nDover accounts for about 17% of UK goods trade. It handled 2.4 million trucks in 2019, and another 1.6 million passed through the nearby Eurotunnel under the Channel.\nTrucks parked near Folkestone, Kent after the Port of Dover was closed and access to the Eurotunnel terminal was suspended after France said that it would not accept any passengers arriving from the UK for 48 hours.\nBusinesses are increasingly worried that a Brexit deal won't materialize, and they have been racing to get goods into the country before year-end. New customs checks and paperwork will result in significant delays to shipments, while tariffs and quotas would pile on the pain in a \"no-deal\" scenario.\nToyota shuts plants\nHonda HMC Earlier this month,was forced to halt production for three days at a major plant in England because parts deliveries were delayed, a sign of how quickly supply chain issues can cause disruptions. Honda said Monday it was monitoring the situation at UK ports, adding it currently did not anticipate any impact on production.\nToyota TM Butsaid it had decided to shut its manufacturing plants in France and the United Kingdom earlier than planned for the winter break.\nThe company blamed UK traffic bans from a growing number of countries and the \"uncertain nature of how long the borders will be closed for logistics activities.\"\nFrance said Monday that it wants a new European-wide health protocol that would allow cross-border traffic to resume, while British traders are calling for truck drivers to be tested for Covid-19 in order to restore confidence.\n\"We have our drivers who do not want to go to the UK because of fear to not be able to come back as the borders are closed,\" said Vanessa Ibarlucea, a spokesperson for the French National Road Haulage Federation. \"It is going to cause an issue regarding the flows which are likely to stop, and therefore cause a drying-up of supply across the Channel ahead of the Brexit day.\"\n— Robert North, Pamela Boykoff, Hanna Ziady, Sarah Dean, Fanny Bobille, Fanny Wang and Stephanie Halasz contributed reporting.", "url": "https://edition.cnn.com/2020/12/21/business/uk-ports-covid-brexit-shortages/index.html"}