{"authors": ["Ben Morse"], "date_download": "2020-12-28 15:49:01", "date_modify": "2020-12-28 15:49:01", "date_publish": "2020-12-22 12:11:16", "description": "Kermit the Frog, Miss Piggy and Fozzie Bear played starring roles in Monday Night Football or rather, \"Muppet Night Football.\"", "filename": "2020_12_22_sport_pittsburgh_623f11a16bc7dce7f96c498b3a9ebbef_index_1609170541.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/201222064410-restricted-02-steelers-bengals-1221-super-tease.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/edition.cnn.com/2020_12_22_sport_pittsburgh_623f11a16bc7dce7f96c498b3a9ebbef_index_1609170541.html", "title": "Pittsburgh Steelers lose third straight game in 'Muppet Night Football'", "title_page": "Pittsburgh Steelers lose third straight game in 'Muppet Night Football' - CNN", "title_rss": "NULL", "source_domain": "edition.cnn.com", "maintext": "(CNN) Kermit the Frog, Miss Piggy and Fozzie Bear played starring roles in Monday Night Football or rather, \"Muppet Night Football.\"\nKermit said he couldn't wait to see them \"throw around the ole pigskin,\" but by the end of the evening, the once unbeatable Pittsburgh Steelers weren't laughing very much.\nPreviously a league-best, undefeated 11-0, the Steelers have lost their last three games, including on Monday, going down 27-17 to the Cincinnati Bengals and its third-string quarterback Ryan Finley.\nA host of characters from The Muppets introduced the NFL game between the two AFC North teams to mark the holiday season.\nBen Roethlisberger passes the ball during the game against the Cincinnati Bengals.\nIt is the third year ESPN have used a special holiday presentation for its Monday Night Football game before Christmas. Previous games have featured Scrooge and an adaptation of the story \"Twas the Night Before Christmas.\"\nDespite Steelers quarterback Ben Roethlisberger hitting a milestone as he reached 60,000 career passing yards, his team never led, trailing by as much as 17 to their division rivals, who were without their rookie sensation quarterback Joe Burrow after he injured his knee earlier in the season.\nHowever, Burrow continued to show his support for his team from a watching position, saying : \"YESSIR\" after the victory, although he did admit he'd much rather be out on the field with his teammates.\n\"Confirmed: watching is not as fun as playing,\" the No. 1 pick in the 2020 draft tweeted\nHaving played with an offense that has looked dysfunctional in their previous two defeats, it was more of the same in the first half for Pittsburgh, as they turned the ball over three times to allow the previously two-win Bengals to race to a 17-0 half-time lead.\nIndeed, tensions between the two division rivals were ramped up in the pre-game warm-ups. Videos of wide receiver Juju Smith-Schuster dancing on the Bengals logo before the game seemed to fire up the Cincinnati defence. And, in the first quarter, safety Vonn Bell produced a heavy hit to force a fumble from Smith-Schuster and reclaim possession.\nAlthough the Pittsburgh offense performed better in the second half, they couldn't overturn their first half deficit, inflicting their third defeat in a row.\nSteelers head coach Mike Tomlin admitted his team are \"not a good football group right now.\"\nVonn Bell forces a fumble by JuJu Smith-Schuster during the first quarter in their game.\n\"I want to give (the Bengals) credit, but largely, we have a lot of work to do,\" he told the media afterwards.\n\"We're not a good football group right now. We understand the consequences that come with that. We are working on a short week. We have to be better than what we've been. That's just the reality of it.\"\nIn a competitive division, alongside the 10-4 Cleveland Browns -- who the Steelers play on January 3 -- and the 9-5 Baltimore Ravens, the final playoff seedings look to be heading to the wire, with just two weeks of games remaining.", "url": "https://edition.cnn.com/2020/12/22/sport/pittsburgh-steelers-cincinnati-bengals-muppets-nfl-spt-intl/index.html"}