{"authors": ["Kate Sullivan"], "date_download": "2020-12-28 15:48:43", "date_modify": "2020-12-28 15:48:43", "date_publish": "2020-12-22 23:15:28", "description": "President-elect Joe Biden on Tuesday urged Americans to steel themselves for dark days ahead battling the coronavirus pandemic.", "filename": "2020_12_22_politics_biden-key-lines-christmas-address_index_1609170523.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/201222163909-joe-biden-ataque-cibernetico-critica-gobierno-trump-mensaje-fin-de-ano-sot-00001022-super-tease.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/edition.cnn.com/2020_12_22_politics_biden-key-lines-christmas-address_index_1609170523.html", "title": "Key lines from Biden's remarks ahead of Christmas", "title_page": "Key lines from Biden's remarks ahead of Christmas  - CNNPolitics", "title_rss": "NULL", "source_domain": "edition.cnn.com", "maintext": "He lambasted the Trump administration for the recent massive cyberattack on US federal agencies, and President Donald Trump for downplaying the attack.\nBiden also said Trump's team has not been fully cooperating with his transition team and that the Defense Department \"won't even brief us on many things.\"\nThe President-elect praised Congress for passing a Covid-19 economic relief package but said it isn't enough and laid out the additional requests he will make of Congress once he takes office in January.\nHe said there wasn't an \"obvious choice in my mind\" for who should be his attorney general nominee, which will be one of the highest-profile positions in his administration.\nHere are all of the key lines from the President-elect's Tuesday remarks:\nThe coronavirus pandemic\nJUST WATCHED Biden: Darkest days in Covid-19 battle are ahead of us Replay More Videos ... MUST WATCH Biden: Darkest days in Covid-19 battle are ahead of us 01:57\n\"One thing I promise you about my leadership during this crisis: I'm going to tell it to you straight. I'm going to tell you the truth. And here's the simple truth: Our darkest days in the battle against Covid are ahead of us, not behind us,\" Biden said.\n\"So we need to prepare ourselves, to steel our spines,\" the President-elect continued. \"As frustrating as it is to hear, it's going to take patience, persistence and determination to beat this virus. There will be no time to waste in taking the steps we need to turn this crisis around.\"\nBiden spoke about how, like many other Americans, he is heeding the advice of public health experts and forgoing holiday traditions.\n\"Like we did over Thanksgiving, we all have to care enough for each other that we have to stay apart just a little bit longer. I know it's hard,\" Biden said.\nPublic health experts have advised Americans to not travel or gather in large groups as coronavirus cases spike and the death toll rises across the country.\n\"Our hearts go out to all of you who have fallen on hard times -- through no fault of your own, I might add -- unable to sleep at night, way down with the worry of what tomorrow will bring to you and for your family,\" he said.\nThe cyberattack on US federal agencies\nJUST WATCHED Biden slams Trump's response to massive cyberattack Replay More Videos ... MUST WATCH Biden slams Trump's response to massive cyberattack 02:51\n\"There's still so much we don't know, including the full scope of the breach or the extent of the damage it has caused. But we know this much: This attack constitutes a grave risk to our national security,\" Biden said, in his most extensive comments on the matter to date.\n\"The Trump administration failed to prioritize cybersecurity,\" he said. He criticized Trump for downplaying the cyberattack and contradicting Secretary of State Mike Pompeo's public remarks linking the hack to Russia.\nBiden said the Trump administration needs to \"make an official attribution.\"\n\"This assault happened on Donald Trump's watch when he wasn't watching. It's still his responsibility as President to defend American interests for the next four weeks,\" Biden said.\nCongress' Covid-19 economic relief package\n\"Like all compromises, it's far from perfect. But it does provide vital relief at a critical moment,\" Biden said of the far-reaching $900 billion Covid relief package passed by Congress on Monday. The legislation aims to accelerate vaccine distribution and deliver much-needed aid to small businesses hit hard by the pandemic, Americans who have lost their jobs and front-line health care workers.\nBiden said his former 2020 primary rival, Sen. Bernie Sanders of Vermont, and Senate Republicans deserved credit for getting $600 stimulus checks included in the package.\nThe President-elect has said that while immediate funding from Congress is critical, his administration will seek further measures when he takes office in January. He laid out what he would specifically ask of Congress, in response to a question from CNN's Jeff Zeleny:\n\"Number one, making sure we have all the money we need to get the vaccine to 300 million Americans at a minimum over the next year, the next calendar year,\" Biden said.\n\"Number two, making sure that all those people who are unemployed through no fault of their own because of the Covid crisis, and small businesses and big businesses, etcetera, are shutting down, that they continue to be able to live day to day. They don't engage in food shortage, they're not in a position where they get thrown out of their homes. I would also be asking for a moratorium on being evicted from your homes from failure to pay rent, moratoriums on, relating to the issue of whether or not your mortgage are being paid,\" the President-elect said.\n\"Thirdly, I think it's critically important we provide all of the (personal protective equipment) as well as the direct payments to small businesses and others to be able to stay open, to be able to keep their people employed,\" Biden said.\nThe transition of power\nBiden said Trump's team has not been fully cooperating with his transition team to share information and ensure a smooth handoff between administrations.\n\"The President's team, for the next four weeks, need to cooperate fully, which they haven't been doing, to share information that becomes available on both the impact and our response to ensure a smooth transition to protect the American people as administrations change,\" Biden said.\n\"The Defense Department won't even brief us on many things,\" he said.\nBiden's attorney general pick\nBiden said there was \"not an obvious choice in my mind\" for his nominee for attorney general.\n\"As you know, there's been a great debate about, in every single appointment, whether or not people, there are enough African Americans, enough Hispanics, enough Asian Pacific Americans, enough people who are new and young, so we're just working through it,\" Biden said. He is no longer expected to announce his attorney general pick before Christmas, according to a person familiar with the matter.\nThe President-elect said the federal investigation into the business dealings of his son, Hunter Biden , had not come up in his discussions with potential attorney general picks.\n\"The attorney general of the United States of America is not the president's lawyer,\" Biden said in response to a question from a reporter. \"I will appoint someone who I expect to enforce the law as the law is written, not guided by me.\"\nFederal authorities are investigating the business dealings of the younger Biden, a person with knowledge of the probe previously told CNN. The President-elect is not implicated.\nThe Covid-19 vaccine\n\"We have a long way to go, but we're grateful that we've got the vaccine, and yesterday, in an effort to instill some confidence in the vaccine, I had my shot administered in public,\" Biden said.\n\"I look forward to the second shot, and I have absolute confidence in the vaccine,\" he said on Tuesday. \"But we're in short supply. Taking the vaccine from a vial into the arm of millions of Americans is one of the biggest operational challenges the United States has ever faced.\"\nFiling for reelection\nBiden was asked by a reporter on Tuesday whether he would consider filing for reelection early next year \"to show that you're not going to be a lame duck.\"\n\"I'm not going to be a lame duck,\" Biden said. \"Just watch me.\"", "url": "https://edition.cnn.com/2020/12/22/politics/biden-key-lines-christmas-address/index.html"}