{"authors": ["Maeve Reston", "Alex Rogers", "Daniella Diaz"], "date_download": "2020-12-28 15:48:47", "date_modify": "2020-12-28 15:48:47", "date_publish": "2020-12-22 18:14:32", "description": "Gov. Gavin Newsom appointed California Secretary of State Alex Padilla to fill Vice President-elect Kamala Harris' Senate seat on Tuesday, choosing the first Latino in state history for the role.", "filename": "2020_12_22_politics_alex-padilla-senate-gavin-newsom_index_1609170527.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/201222130046-alex-padilla-file-super-tease.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/edition.cnn.com/2020_12_22_politics_alex-padilla-senate-gavin-newsom_index_1609170527.html", "title": "Newsom picks Alex Padilla to fill Kamala Harris' Senate seat", "title_page": "Alex Padilla: Gavin Newsom picks California secretary of state to fill Kamala Harris' Senate seat - CNNPolitics", "title_rss": "NULL", "source_domain": "edition.cnn.com", "maintext": "Washington (CNN) Gov. Gavin Newsom appointed California Secretary of State Alex Padilla to fill Vice President-elect Kamala Harris' Senate seat on Tuesday, choosing the first Latino in state history for the role.\nNewsom, who had been under intense pressure within California to choose a Black woman to replace Harris because of the lack of diversity in the US Senate -- tweeted that Padilla's appointment would make history but added that Padilla \"is far more interested in changing history -- especially for the working men and women of our state and country.\"\n\"I can think of no one better to represent the state of California as our next United States Senator,\" Newsom tweeted Tuesday. The California governor extended the offer to Padilla in a video conversation that he released in his tweet.\nPadilla will serve through the duration of Harris' term, and will have to prepare for a highly competitive statewide race to fill the seat in 2022.\nPadilla, the son of a cook and house cleaner who immigrated from Mexico, choked up when speaking to Newsom about his parents on the video as he accepted the position.\n\"I'm honored, man, and I'm humbled, because of them,\" Padilla says.\nIn his announcement, Newsom noted that Padilla, 47, had worked his way from \"humble beginnings to the halls of MIT,\" where he got his bachelor of science degree in mechanical engineering. He entered politics as an aide to Democratic Sen. Dianne Feinstein of California, was elected to the Los Angeles City Council at the age of 26 and later became the council's youngest president in its history. He moved on to the state Senate in 2006, representing the San Fernando Valley.\n\"Through his tenacity, integrity, smarts and grit, California is gaining a tested fighter in their corner who will be a fierce ally in D.C., lifting up our state's values and making sure we secure the critical resources to emerge stronger from this pandemic,\" Newsom said in a statement. \"He will be a Senator for all Californians.\"\nHis appointment will make history. But the @AlexPadilla4CA I know is far more interested in changing history -- especially for the working men and women of our state and country.\nI can think of no one better to represent the state of California as our next United States Senator. pic.twitter.com/xiAzpTS42Y — Gavin Newsom (@GavinNewsom) December 22, 2020\nNewsom chose his longtime political ally after what was described as difficult decision-making process as the governor weighed the competing pressures of the desire to see the first Latino from California in the US Senate and the paucity of Black representation in that chamber.\nThere will be no Black women in the Senate after Harris' exit in January to join President-elect Joe Biden's administration. Top contenders for Harris' seat included Rep. Karen Bass, who represents much of South Los Angeles, and Rep. Barbara Lee of Oakland, but neither had as close a relationship to Newsom as Padilla.\nWhen Newsom ran his first campaign for governor in 2009, Padilla served as his campaign chairman until Newsom dropped out when former Gov. Jerry Brown entered the race. (Newsom ultimately served as lieutenant governor to Brown).\nPadilla, a warm and personable figure who has many allies in California Democratic political circles, had other prominent backers, including the Congressional Hispanic Caucus' BOLD PAC and Feinstein\nThe California Legislative Black Caucus and other groups had pushed for Bass and Lee to replace Harris. The Women's Foundation of California joined the campaign urging Newsom to appoint a Black woman, enlisting Latina labor icon Dolores Huerta, among others, to sign a letter to the governor\n\"Women's voices are desperately needed, but Black women's voices are especially needed at this time in history,\" Huerta said in a video she recorded for the push. She said Newsom should take that step \"to correct the terrible history of discrimination that Black women have suffered through the ages. And you will actually cement your own legacy as part of the civil rights movement by doing this.\"\nLee tweeted Tuesday that Padilla \"has a track record as a skilled legislator and a steadfast advocate for justice\" and said he would be \"a powerful voice in the Senate for those who continue to be denied our country's promise of equality.\"\nBass also congratulated Padilla on Twitter , noting they had served together in the state Legislature, where \"he passed landmark legislation to make California the first state in the nation to require chain restaurants to post calorie information directly on menus,\" and praising him for modernizing California's electoral and vote-by-mail processes as secretary of state.\n\"Today, our state gains yet another champion following a distinguished line of individuals who have shattered glass ceilings and hurdled obstacles in their way,\" Bass said of the Padilla pick. \"After then-Senator Harris's historic election in 2016 as the first woman of color to represent California, we now have another historic barrier shattered as Alex will be the first Latino to serve California in the United States Senate.\"\nA difficult moment for Newsom\nThe pick comes at a tough time for Newsom , who is struggling to curb the coronavirus pandemic as it ravages California, lowering intensive care unit capacity to zero in some parts of the state. With soaring unemployment amid the state's economic downturn as a result of the virus, his decision to revert to shutdowns for parts of the state with limited numbers of remaining hospital beds infuriated some restaurant and business owners.\nThe anger has breathed new life into a recall campaign that was launched by activists last spring and is now serving as a vehicle for California Republicans who would like to see him removed from office.\nNewsom also recently caught heat for attending a dinner at the French Laundry restaurant at a time when he and other state officials were urging Californians to limit gatherings with people from outside their households, particularly at restaurants. The governor apologized to the state's voters, telling them he needed to \"preach and practice, not just preach and not practice.\"\nNewsom must also now appoint a replacement for California Attorney General Xavier Becerra, who was chosen by Biden to serve as secretary of Health and Human Services , as well as a replacement for Padilla.\nPadilla, who has served as secretary of state since 2015, was in charge of the unprecedented task of sending mail-in ballots to more than 22 million registered voters, leading to record turnout this year.\nOthers who were in contention for the Senate appointment included California's Rep. Katie Porter, Long Beach Mayor Robert Garcia, state Senate President Pro Tempore Toni Atkins and Lt. Gov. Eleni Kounalakis.\nIn a recent interview, Padilla told CNN that the state's first Latino senator would be \"a historic milestone,\" and said that California's \"rich diversity\" is surely \"one of the many considerations the governor is pondering as he makes this decision.\"\n\"A lot of people are excited about a potential first,\" he said.\nPadilla told CNN that he was well prepared to serve in the Senate after dealing with the L.A. budget after 9/11, chairing a state Senate committee on energy and telecommunications, and securing the integrity of the ballot box in the middle of a pandemic.\n\"There's no on-the-job training here,\" Padilla said.\nThis story has been updated with additional background information.", "url": "https://edition.cnn.com/2020/12/22/politics/alex-padilla-senate-gavin-newsom/index.html"}