{"authors": ["Chauncey Alcorn", "Cnn Business"], "date_download": "2020-12-28 15:48:58", "date_modify": "2020-12-28 15:48:58", "date_publish": "2020-12-23 18:44:25", "description": "Nikola Motor Company's plans to mass produce garbage trucks for Republic Services, one of the nation's largest waste management service providers, were canceled Wednesday morning, the latest in a string of bad news for the electric truck and hydrogen cell maker.", "filename": "2020_12_23_tech_nikola-garbage-truck-canceled_index_1609170538.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200810160610-nikola-refuse-truck-super-tease.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/edition.cnn.com/2020_12_23_tech_nikola-garbage-truck-canceled_index_1609170538.html", "title": "Nikola and Republic Services scrap their electric garbage truck", "title_page": "Nikola and Republic Services scrap their electric garbage truck - CNN", "title_rss": "NULL", "source_domain": "edition.cnn.com", "maintext": "New York (CNN Business) Nikola Motor Company's plans to mass produce garbage trucks for Republic Services, one of the nation's largest waste management service providers, were canceled Wednesday morning, the latest in a string of bad news for the electric truck and hydrogen cell maker.\nNikola's NKLA In August, the company had announced plans to produce as many as 5,000 trucks for Republic Services, which has sought to build a more sustainable fleet of garbage trucks to better meet emissions standards.stock shot up 22% after the deal was originally announced.\nBut Nikola's stock price nosedived 10% Wednesday morning after the deal was publicly canceled. Wedbush analysts gave Nikola an \"underperform\" rating in response to the announcement, which the firm said was a \"gut punch\" to investors who were counting on the Republic Services deal to be a game changer for the struggling startup.\n\"Given the tidal wave of bad news for Nikola over the last few months this was not the news that investors wanted to see under their Christmas tree,\" Wedbush analyst Dan Ives wrote in a note to investors Wednesday morning. \"The company still has a Kilimanjaro like uphill climb to gain back Street credibility heading into 2021 with today's news viewed as another step backwards,\" the firm added.\nNikola said both companies agreed to cancel the deal after they determined combining new technologies and design concepts to make the electric trucks would take longer and cost more than initially anticipated.\nRead More", "url": "https://edition.cnn.com/2020/12/23/tech/nikola-garbage-truck-canceled/index.html"}