{"authors": ["Jordan Valinsky", "Cnn Business"], "date_download": "2020-12-28 15:48:30", "date_modify": "2020-12-28 15:48:30", "date_publish": "2020-12-21 12:29:42", "description": "Walmart is attempting to solve one of the biggest pain-points of online shopping — the dreaded return — with a new service.", "filename": "2020_12_21_business_walmart-returns-at-home_index_1609170510.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/201221113730-walmart-home-returns-super-tease.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/edition.cnn.com/2020_12_21_business_walmart-returns-at-home_index_1609170510.html", "title": "Walmart is attempting to solve one of the biggest pain-points of online shopping", "title_page": "Walmart one-ups Amazon: You don't need to leave home to return packages for free - CNN", "title_rss": "NULL", "source_domain": "edition.cnn.com", "maintext": "New York (CNN Business) Walmart is attempting to solve one of the biggest pain-points of online shopping — the dreaded return — with a new service.\nFedEx FDX The retailer announced Monday that it will pick up items shipped and sold by Walmart.com from customers' homes through a new partnership with. Walmart said the \"incredibly convenient\" option is free and will remain in place beyond the busy holiday shopping season.\nTo use the new service, called \"Carrier Pickup by FedEx,\" customers have the initiate return process on Walmart's website or app, schedule a date for pickup and print a label. Then it will be picked up by a FedEx employee.\nFor those that don't have a printer, customers can also make a return at any of the roughly 2,000 US FedEx Office locations by getting a QR code from Walmart's website and a FedEx employee will print a free return label and ship it back — a similar service that is already offered by Amazon and UPS.\nThe new shipping options comes as Walmart's US online sales soared 79% in the most recent quarter, signaling that it's in the midst of another strong holiday season especially as people shift their habits online during the pandemic.\nRead More", "url": "https://edition.cnn.com/2020/12/21/business/walmart-returns-at-home/index.html"}