{"authors": [], "date_download": "2020-12-28 15:49:13", "date_modify": "2020-12-28 15:49:13", "date_publish": "2019-06-27 10:47:00", "description": "In a new interview for Self magazine, the singer-songwriter recounts what it was like to learn she'd be a mom once more.", "filename": "2019_06_27_alanis-morissette-pregnancy-45-i-had-freak-out-joy-freak-t157206_1609170553.html", "image_url": "https://static.euronews.com/articles/3988062/1000x563_nbc-alanis-morissette-pregnant-self-photo-shoot-today-main-190626_19baafe583cfe6c2a3527e7356062926.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2019_06_27_alanis-morissette-pregnancy-45-i-had-freak-out-joy-freak-t157206_1609170553.html", "title": "Alanis Morissette on pregnancy at 45: I had a 'freak-out-joy-freak-out moment'", "title_page": "Alanis Morissette on pregnancy at 45: I had a 'freak-out-joy-freak-out moment' | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "Alanis Morissette always wanted to be a mother of three, but she never expected that dream to come true the way it has — with a surprise pregnancy at the age of 45.\nIn fact, in an exclusive interview with Self magazine, the singer-songwriter revealed that a series of \"challenges and some miscarriages\" left her feeling that it wasn't even possible.\nAlanis Morisette on the cover of Self. Steph Wilson for SELF\nMorissette, who's already mom to son Ever Imre, 8, and daughter Onyx Solace, 3, had given up on the idea of expanding her family.\nUntil one day ...\n\"I was basically feeling a little unusual,\" she recounted in a video chat that accompanies the story online. \"I've been pregnant before, so I started feeling those familiar feelings of lightheadedness and just certain things, and so I asked my husband to pick up a little pee-on-the-stick (test) on the way home. And then I got my answer.\"\nFollowed by what she now calls a \"complete freak-out-joy-freak-out moment.\"\nThe singer-songwriter got candid about discovering she\\'s pregnant again at the age of 45. Steph Wilson for SELF\nHowever, this unexpected pregnancy is, in many ways, the one she feels most prepared for.\n\"I think this pregnancy is different from the first two times because of my ability to sense what's going on inside my body in a lot more of a subtle way,\" she explained. \"I'm one of those women who actually enjoy being pregnant. I think one of the biggest parts of it is that I feel just sort of innately purposeful, in that even when I sitting still ... I'm still being productive. I'm still building a human being, which still boggles my mind.\"\nAnd while she's \"building a human,\" she's also healing herself.\nMorisette, who's been open about her past struggles with eating disorders, revealed that this pregnancy has allowed her to have a \"fun\" relationship with food again.\n\"For me, it allows me to really get connected with my appetite, and how that appetite is serving the whole system of my body. So it's been really fun,\" she said. \"I'm actually very much enjoying this pregnancy, for that reason, as well as others, but that one's a big one. My relationship with food is really pure.\"\nThe \"You Oughta Know\" singer told Self, \"I had a complete freak-out-joy-freak-out moment, and then the journey began once again.\" Steph Wilson for SELF\nWith both of her past pregnancies, the \"You Oughta Know\" hit-maker suffered postpartum depression, but she told Self that she has a brighter outlook as she approaches her due date this time around — not because she thinks she'll avoid the condition, but because she's ready for it.\n\"The first time around, I didn't seek help for a year and four months, and I remember calling a doctor and I said, 'Does this get easier if I kind of stick it out and soldier through it?' — which had been my way of approaching almost everything in my life, just soldier though — and she said, 'No, it actually gets worse.'\"\nShe then addressed her depression \"in multiple ways,\" but when the next baby came around, she still waited four months before reaching out and getting the help she needed.\n\"This time, I'm not even waiting four minutes,\" she insisted.\nThe soon-to-be mother of three confessed that she always dreamed of having three children. Steph Wilson for SELF\nInstead, she's already planning to reach out to others — and to have them reach out to her, even if she doesn't.\n\"I'm just going to be like, 'OK, everybody, even if I say I'm OK, I want you to resist believing me at first,'\" Morissette said. \"I'm going to be a lot more attuned to what's going on, because depression has a way of taking away self-perception.\"\nAnd she doesn't want to let anything take away from the joy she's feeling now.", "url": "https://www.euronews.com/2019/06/27/alanis-morissette-pregnancy-45-i-had-freak-out-joy-freak-t157206"}