{"authors": [], "date_download": "2020-12-28 15:49:13", "date_modify": "2020-12-28 15:49:13", "date_publish": "2011-11-19 00:00:00", "description": "US President Jimmy Carter to undergo procedure to relieve pressure on brain after falls", "filename": "2019_11_12_president-jimmy-carter-undergo-procedure-relieve-pressure-brain-falls-n1080361_1609170553.html", "image_url": "https://static.euronews.com/articles/4294680/1000x563_nbc-191111-jimmy-carter-ew-912p_57e40e5b7360484054ff92e6b110fcf1.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2019_11_12_president-jimmy-carter-undergo-procedure-relieve-pressure-brain-falls-n1080361_1609170553.html", "title": "US President Jimmy Carter to undergo procedure to relieve pressure on brain after falls", "title_page": "US President Jimmy Carter to undergo procedure to relieve pressure on brain after falls | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "Former President Jimmy Carter was admitted to a Georgia hospital Monday and is scheduled to undergo a procedure to relieve pressure on his brain caused by bleeding from recent falls, The Carter Center said.\nThe procedure is set for Tuesday morning at Emory University Hospital in Atlanta.\n\"President Carter is resting comfortably, and his wife, Rosalynn, is with him,\" The Carter Center statement said.\nIn October, Carter turned 95, becoming the first U.S. president to reach that milestone.\nLater that month, the former president fractured his pelvis when he fell at his home, the Carter Center said at the time. The fracture was called minor.\nHe had fallen earlier in the month and received stitches above his brow. He was reported to be feeling fine after that Oct. 6 incident at his home.\nIn May, Carter broke his hip and underwent surgery after he falling at his home in Plains, Georgia, as he was leaving to go turkey hunting.\nCarter, the 39th president, said in August 2015 that he had been diagnosed with cancer and would undergo treatment for several melanoma spots on his brain and liver. He had previously had a mass removed from his liver that was melanoma.\nHe said months later that an MRI scan showed his cancer was gone.\nCarter was awarded the 2002 Nobel Peace Prize and has spent his post-presidential years as a highly visible advocate for the poor worldwide.\nSoon after his fall on Oct. 6, Carter appeared at a Habitat for Humanity project.\nRev. Tony Lowden, Carter's pastor, said the former president was hospitalized Monday after \"a rough day.\"\n\"We just need the whole country to be in prayer for him,\" Lowden told The Associated Press in a telephone interview.\nThe Maranatha Baptist Church said in a statement on Facebook that the former president will not be teaching Sunday school this week, and it asked people to pray for him and his family", "url": "https://www.euronews.com/2019/11/12/president-jimmy-carter-undergo-procedure-relieve-pressure-brain-falls-n1080361"}