{"authors": [], "date_download": "2020-12-28 15:49:14", "date_modify": "2020-12-28 15:49:14", "date_publish": "2019-11-09 07:08:46", "description": "Bloomberg faces big challenges if he leaps into 2020 White House race", "filename": "2019_11_09_bloomberg-faces-big-challenges-if-he-leaps-into-2020-white-house-race_1609170554.html", "image_url": "https://static.euronews.com/articles/wires/05/35/68/88/1000x563_bloomberg-faces-big-challenges-if-he-leaps-into-2020-white-house-race.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2019_11_09_bloomberg-faces-big-challenges-if-he-leaps-into-2020-white-house-race_1609170554.html", "title": "Bloomberg faces big challenges if he leaps into 2020 White House race", "title_page": "Bloomberg faces big challenges if he leaps into 2020 White House race | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "Former New York City Mayor Michael Bloomberg has the money and name recognition to shake up the Democratic presidential race, but he will face huge hurdles to the nomination if he makes the leap to become a formal candidate.\nThe billionaire media mogul is laying the groundwork for a possible candidacy and kept his options open by filing paperwork on Friday to run in the Democratic primary in Alabama, which has an early deadline for ballot qualification.\nThe decision to run would be an about-face for Bloomberg, 77, who announced in March that he would not seek the White House.\nRanked by Forbes as the eighth-richest American with an estimated worth of $53.4 billion, his potential bid drew immediate criticism that he was just another wealthy businessman trying to buy an election.\nBloomberg also will face questions about his record as a three-term mayor of New York, particularly from the Democratic Party's vocal progressive wing, and about why he is needed in a race that still has 17 candidates vying to challenge Republican President Donald Trump in November 2020.\n\"There is no constituency for Michael Bloomberg that isn't already taken by one of the candidates who are already running,\" said Charles Chamberlain, chair of the Vermont-based progressive group Democracy for America.\nBut Bloomberg is skeptical that any of the current candidates can beat Trump, according to a spokesman.\nThe late entry into the race would force Bloomberg to play a quick game of catch-up to build the sort of campaign infrastructure his rivals have spent months constructing.\nAs a result, Bloomberg will skip early contests like the Feb. 3 caucus in Iowa and emphasize later voting states where his rivals will not have as big an organizing advantage, starting with the Super Tuesday primaries in at least 15 states including Alabama on March 3.\n\"If we run, we are confident we can win in states voting on Super Tuesday and beyond, where we will start on an even footing,\" Bloomberg adviser Howard Wolfson said in a statement reported by the Washington Post.\nOpinion polls show three contenders battling at the top of the Democratic race: U.S. Senators Elizabeth Warren of Massachusetts and Bernie Sanders of Vermont, who lead the progressive wing, and moderate Joe Biden, the former vice president.\nBloomberg has been critical of Warren and her desire to institute a tax on the super-wealthy, which she would use to fund programs ranging from universal healthcare to free college tuition.\nBiden, meanwhile, has turned in uneven debate performances and lagged behind his top rivals in fundraising. Bloomberg would likely seek to appeal to the same moderate voters drawn to Biden.\n\"It's almost like he's running because this billionaire wants to stop Elizabeth Warren,\" Brad Bannon, a Democratic strategist who advises progressive groups and labor unions, said of Bloomberg. \"It's lousy for Joe Biden but great for Elizabeth Warren.\"\nPublic opinion polls show most Democrats do not share Bloomberg's dissatisfaction with the contenders. A Monmouth University poll taken in late October and early November found three-fourths of Democrats were satisfied with their choice of candidates and just 16% wanted someone else.\nRenewed scrutiny\nAt 77, Bloomberg, the chief executive officer and founder of Bloomberg LP, would be the second-oldest candidate among the Democrats in a race where age has been an issue. Sanders, who took time off the campaign trail after a heart attack, is 78. Biden is 76, and Warren is 70. Trump is 73.\nBloomberg's record as a New York mayor, and for nearly 40 years running his own company, will come under renewed scrutiny in a presidential race.\nHe is certain to face criticism for New York's implementation of \"stop and frisk,\" a policy that allowed police to stop and search people on the street that was decried as racist for overwhelmingly targeting black men. African-American voters are a critical Democratic voting bloc.\nBloomberg has been panned for attempting to ban sodas sold in cups larger than 16 ounces (473 milliliters), a proposal that drew national criticism for supporting a \"nanny state\" that was ultimately struck down by New York courts.\nBloomberg also will face questions about his decision to run for New York mayor in 2001 as a Republican. He switched to independent before he ran for a third term in 2009. In 2018, while weighing whether to run for president, he switched his party registration again and became a Democrat.\nAfter leaving office, he emerged as one of the strongest supporters of gun-control measures, pouring millions of dollars into advocacy groups that push for measures to ban the sale of some guns and make it harder to purchase others.\n\"It's going to be difficult, but we've never really seen a candidate with this amount of resources at his disposal,\" said veteran Iowa Democratic operative Grant Woodard, an aide to Hillary Clinton in 2008.\n\"A lot of people here haven't made up their minds,\" he added. \"There could still be an opening for him.\"", "url": "https://www.euronews.com/2019/11/09/bloomberg-faces-big-challenges-if-he-leaps-into-2020-white-house-race"}