{"authors": [], "date_download": "2020-12-28 15:49:15", "date_modify": "2020-12-28 15:49:15", "date_publish": "2019-11-08 07:15:26", "description": "Bloomberg considering jumping into 2020 Democratic presidential race", "filename": "2019_11_08_former-nyc-mayor-michael-bloomberg-considering-jump-into-us-presidential-race_1609170555.html", "image_url": "https://static.euronews.com/articles/wires/05/35/45/32/1000x563_bloomberg-considering-jumping-into-2020-democratic-presidential-race.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2019_11_08_former-nyc-mayor-michael-bloomberg-considering-jump-into-us-presidential-race_1609170555.html", "title": "Former NYC mayor Michael Bloomberg considering jump into US presidential race", "title_page": "Former NYC mayor Michael Bloomberg considering jump into US presidential race | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "Former New York City Mayor Michael Bloomberg is strongly considering entering the race for the 2020 Democratic presidential nomination, a move that could greatly disrupt the field just three months before the first nominating contests.\nBloomberg, the billionaire media mogul and philanthropist who served three terms as mayor of America's largest city, is sceptical that any of the current crop of Democratic candidates can defeat Republican President Donald Trump in next year's general election, a spokesman said.\n\"Mike is increasingly concerned that the current field of candidates is not well positioned to\" beat Trump, Bloomberg spokesman Howard Wolfson said in a statement.\nBloomberg, 77, is expected to file paperwork this week to run in the Democratic presidential primary in Alabama, which has an early deadline for qualifying for the ballot. That would keep his options open for a possible White House bid, a source familiar with his thinking told Reuters.\nThe Democratic field, now numbering 17 candidates, has coalesced into four top contenders according to recent polls: US Senators Elizabeth Warren and Bernie Sanders, who represent the party's progressive wing, and former Vice President Joe Biden and Mayor Pete Buttigieg, of South Bend, Indiana, representing the more moderate wing.\nBloomberg, the chief executive officer and founder of Bloomberg L.P, served as New York's mayor from 2002 to 2013 and has been a leading advocate and philanthropist on the issues of climate change and gun violence.\n\"If Mike runs, he would offer a new choice to Democrats built on a unique record running America’s biggest city, building a business from scratch and taking on some of America’s toughest challenges as a high-impact philanthropist,\" Wolfson said.\n\"Mike would be able to take the fight to Trump and win,\" Wolfson said.\nBloomberg has been critical of Warren and her plan to institute a tax on the superrich if she is elected president to fund programs ranging from universal health care to free college tuition. If Bloomberg were to enter the race, he would likely compete with candidates such as Biden and Buttigieg as a moderate alternative to Warren's populist progressivism.\nBut he would likely face a difficult road with the liberal wing of the party concerned about corporate money in politics and income inequality in America.\nTom Steyer, a billionaire candidate from California who has made climate change a centrepiece of his campaign, has spent millions only to see his bid languish amid criticism from his rivals for trying to buy his way into the election.\n\"More billionaires seeking more political power surely isn't the change America needs,\" said Sanders' campaign manager, Faiz Shakir.\nWarren responded to the news of Bloomberg's preparations by tweeting at him with a link that showed how much he would pay under her wealth tax.\nBloomberg, whom Forbes ranks as the eighth richest American with an estimated worth of $53.4 billion (€48.3bn), would be able to largely fund his campaign himself, perhaps allowing him to ramp up his candidacy quickly. Still, he would have to build a multistate organization on the fly.\nAt age 77, he would be the second oldest candidate among the Democratic contenders, behind Sanders, who is 78. Biden is 76 and Warren is 70. On the Republican side, Trump is 73.\nThe Iowa caucuses, the first nominating contest on the Democratic primary calendar, will be held on February 3.", "url": "https://www.euronews.com/2019/11/08/former-nyc-mayor-michael-bloomberg-considering-jump-into-us-presidential-race"}