{"authors": [], "date_download": "2020-12-28 15:49:14", "date_modify": "2020-12-28 15:49:14", "date_publish": "2019-05-01 14:34:00", "description": "The pop singer, who said she's had \"several miscarriages since,\" said the experiences shaped the songs on her new album.", "filename": "2019_05_01_pink-reveals-she-had-miscarriage-17-you-feel-your-body-t153175_1609170554.html", "image_url": "https://static.euronews.com/articles/3838286/1000x563_nbc-pink-reveals-miscarriage-today-main-190430_5d56f0c059095ce87ed6e579cd5e5baf.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2019_05_01_pink-reveals-she-had-miscarriage-17-you-feel-your-body-t153175_1609170554.html", "title": "Pink reveals she had a miscarriage at 17: 'You feel like your body hates you'", "title_page": "Pink reveals she had a miscarriage at 17: 'You feel like your body hates you' | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "Pinkrevealed she had a miscarriage as a teenager and that the loss served as inspiration behind some of the most emotional lyrics on her new album.\nThe pop singer describes feeling insecure about her body in the ballad \"Happy,\" singing that \"since I was 17, I've always hated my body / and it feels like my body's hated me. \"\nPink describes the source behind her lyrics for her song, \"Happy,\" on her new album, \"Hurts 2B Human.\" WireImage\nPink revealed the source behind those lyrics in an interview with USA Today.\n\"The reason I said (that) is because I've always had this very tomboy, very strong gymnast body, but actually at 17 I had a miscarriage,\" Pink told the newspaper.\n\"And I was going to have that child. But when that happens to a woman or a young girl, you feel like your body hates you and like your body is broken, and it's not doing what it's supposed to do,\" the singer continued.\nPink, 39, said she's had \"several miscarriages\" since then and eventually went to therapy to help her deal with the heartbreak. She said she wanted to be honest about her experiences because \"it's important to talk about what you're ashamed of, who you really are and the painful (expletive). I've always written that way.\"\nThe song, \"Happy,\" a track off the album, \"Hurts 2B Human,\" released last Friday, also describes her relationship with husband Carey Hart. The couple are parents to daughter Willow, 7, and son Jameson, 2.\n\"He's the biggest part of my village,\" Pink said of Hart. She said her new album is \"not as angsty and marital as previous records. There's certainly not a place for 'So What' right now.\"\nIn an interview with TODAY's Carson Daly that aired last week, Pink said becoming a mother has completely shaped her self-image and attitude.\n\"I'm much more open, I'm much more accepting of myself, I'm much more thoughtful,\" she said. \"I think about the world more, and what we're leaving for these kids, and the direction we're headed in. And so I guess it changes your music.\"\nPink poses with her husband, Carey Hart, and their children, during the singer\\'s Hollywood Walk of Fame ceremony earlier this year. FREDERIC J. BROWN\nWhile she's often shared photos of Willow and Jameson on social media, Pink has said that will likely end because of the mean-spirited comments some people leave on her posts.\n\"After the latest criticisms, I'm so tired of it, people are just getting nastier and nastier,\" she said earlier this month on \"The Ellen DeGeneres Show.\"", "url": "https://www.euronews.com/2019/05/01/pink-reveals-she-had-miscarriage-17-you-feel-your-body-t153175"}