{"authors": [], "date_download": "2020-12-28 15:49:23", "date_modify": "2020-12-28 15:49:23", "date_publish": "2020-10-02 10:00:33", "description": "Cutting carbon emissions and power costs in Southeast Asia", "filename": "2020_10_02_cutting-carbon-emissions-and-power-costs-in-southeast-asia_1609170563.html", "image_url": "https://static.euronews.com/articles/stories/04/99/81/34/1000x563_cmsv2_4f8cf5b7-4244-5d99-89ae-d15cda10ca12-4998134.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2020_10_02_cutting-carbon-emissions-and-power-costs-in-southeast-asia_1609170563.html", "title": "Cutting carbon emissions and power costs in Southeast Asia", "title_page": "Cutting carbon emissions and power costs in Southeast Asia | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "The world’s demand for power has increased by 85% in the last 20 years, with production responsible for about 25% of greenhouse gas emissions. In Southeast Asia alone, energy consumption is expected to double by 2040.\n© Total\nOn the rooftop of a building in Singapore, beside one of the company’s latest installations, Total Solar Distributed Generation’s CEO, Gavin Adda, explains, “One of the big things people don’t realize about solar power is that with it you can help reduce climate change, achieve sustainability targets, and cut costs at the same time.”\nAdda should know, he has been working in the renewables sector in Asia since 2007, when there were few early adopters. He’s now overseeing Total Solar Distributed Generation's rapid expansion of projects across the region.\nIn this fast-moving technological sector, new customers often have questions. “Should we wait for better solar panels, or cheaper solar panels? Or should we go now? If you look back 10 years, the annual reduction in the cost of solar panels was very high – it made sense to wait,” Adda explains, “We’re now at a stage where it makes sense to install the system now and get that saving immediately, rather than waiting for a system that could be more efficient in the future. The majority of installation cost is labor which is increasing annually with inflation. If you can generate 20-30% of your building’s power from your own roof with a 20-30% savings, you'd want the savings today.”\n© Total\n© Total\nSOLAR POWER IN SINGAPORE\nDemand for sustainable solutions is not just coming from the private sector. “We’re seeing some governments, like in Singapore, taking a very proactive approach,” says Adda, “We provide a solution that’s very quick, such that three months after first talking to a customer, we can sign a contract, and three months after that we can have an operating project. You’ll see the impact of savings in less than a year,” he adds.\nAdda is eight floors up explaining how the solar photovoltaic rooftop system works on Singapore’s biggest automobile hub, the Carros Centre. The complex houses car service centres, auto repair facilities, body and servicing workshops, as well as parts and supplies dealerships. “This project will generate power for the next 30 years. It produces about 20-30% of the building’s power requirements. Any excess power we have, for example on Sundays or public holidays, is sold to the grid.” The installation is designed to generate 570 MWh of renewable electricity per year, avoiding over 225 tons of CO2 emissions over the same period.\n© Total\nEnvironmentally and commercially, solar power makes sense in Singapore. There is a fairly high level of radiation and plenty of rain to keep the solar panels clean. The only limiting factor is a lack of space. “You have to use the rooftops, it’s forgotten space. By putting a solar system on a roof you can generate power and you can cut costs from unused space,” he says.\n“Total has really big ambitions in the renewables space,” explains Adda, “We want to work with local companies to grow faster. Bolloré Logistics is a fantastic example.”\nBolloré Logistics delivers stock to fashion and luxury brands in downtown Singapore. The company's newly installed rooftop solar panels ensure a sustainable supply chain, by powering multi-shuttle automation at their warehouse and charging zero-emission electric vans. The vans will cover more than 90,000 kilometres per year, saving up to 17 tons of CO2 – the equivalent of 6,321 litres of diesel consumed. They also reduce the emission of fine particles, and noise pollution for both drivers and those living in the city.\n© Total\nThere are some constraints, “Capacity is still limited compared to a conventional vehicle,” points out Frédéric Marcerou of Bolloré Logistics Singapore, “But we can do much more back and forth because we are much more sustainable in our deliveries. As a group, we have committed to reduce our carbon footprint by 43% by 2027. So we have to be ambitious.”\nBolloré Logistics' buildings were designed with the idea of putting solar panels on the roof. Installation was problem-free, simply using the lifts inside the building to bring panels up. The company now produces 1.3 gigawatt hours of its own electricity per year and any surplus is channeled into Singapore’s grid.\n© Total\nSUSTAINABILITY ACROSS SOUTHEAST ASIA\nTotal Solar DG has also started construction on the largest single-rooftop project in Thailand, a 7 MW project with 17,500 panels which will eventually generate 9.6 GWh of renewable electricity per year, adding to a portfolio that is expanding at 500% growth annually. “We recently signed a contract to provide rooftop solar projects on 24 facilities for Betagro, the second largest food and agricultural supplier in Thailand. This will be one of the largest rooftop portfolios - at 25 MW – and we can provide massive discounts against the grid there – sometimes as high as 50%,” says Adda.\nShopping malls in the Philippines have proved to be a successful model for the solar photovoltaic rooftop systems. Three new projects are underway in 2020 to add to 12 already completed there.\n© Total\nIslands in particular will reap the environmental and financial benefits of solar power in the long term Adda believes, “In Cambodia, we are solarizing an island that’s been running on diesel - that’s very, very expensive. We are installing solar and energy storage there, enabling 20-30% of their power supply to be independent, which helps to guarantee energy security. This will be one of the largest microgrid projects in the region.”\nTotal Solar installed one of the first no-capex projects in Indonesia - an 800 kWp solar-powered rooftop for Chandra Asri - the biggest petrochemical company in the country. 2,200 solar panels will generate over 935 MWh per year, or 15% of the company’s power needs. Indonesia could prove a particularly important market for Total in the future, as blackouts are already common, there is huge pressure on the current grid and an ever-growing demand for electricity.\nOther countries benefiting from Total Solar DG’s expertise in Southeast Asia include Malaysia and Vietnam. Around the world, Total is installing solar on 5,000 of its gas stations and some of its industrial and commercial sites.\n© Total\nSUPPLY FOR INCREASING DEMAND\nOld systems of electrical power production are struggling to provide. Adda describes the ‘step change’ in power provision, moving from vast power plants in remote locations to getting solar panels up on as many rooftops as possible. “By putting power generation in lots of different locations, you make the grid much more stable,” he explains, “Democratising power generation.”\nAs well as shrinking companies’ environmental footprints, solar power makes financial sense with costs that are stable and predictable, by comparison with certain fossil fuels. One downside is that it can be intermittent, but Total Solar DG is working on that.\nThe price of lithium-ion batteries is dropping and making power storage options easier, smaller and lighter. “That means we can build solar systems with batteries that can provide power, that are stable, that generate power whenever you want it, at reasonable power prices. We can undercut diesel at the moment, and two years, three years from now,” Adda predicts, “We should be able to undercut the grid.”\nThe appetite for energy in Southeast Asia is growing so fast that any extra power produced is easily consumed. “We are installing solar systems as quickly as we can and still not able to keep up with demand,” says Adda, “Customers really want to engage with solar developers that are long-term partners, who build safe systems. There is a real win-win for companies – who can cut costs and carbon - while governments are happy that more power is being generated locally rather than needing to rely on imports.”", "url": "https://www.euronews.com/2020/10/02/cutting-carbon-emissions-and-power-costs-in-southeast-asia"}