{"authors": [], "date_download": "2020-12-28 15:49:24", "date_modify": "2020-12-28 15:49:24", "date_publish": "2020-11-09 22:09:09", "description": "Under the new rules, European companies will have to apply for government licenses to export certain products and they'll have to meet criteria that have been beefed up to include requirements to consider whether the sale poses a risk to human rights.", "filename": "2020_11_09_a-win-for-global-human-rights-as-eu-agrees-on-tighter-rules-for-surveillance-tech-exports_1609170564.html", "image_url": "https://static.euronews.com/articles/stories/04/66/60/68/1000x563_cmsv2_6882bf5d-2363-59fe-a1e4-87ca2faaf29e-4666068.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2020_11_09_a-win-for-global-human-rights-as-eu-agrees-on-tighter-rules-for-surveillance-tech-exports_1609170564.html", "title": "'A win for global human rights' as EU agrees on tighter rules for surveillance tech exports", "title_page": "'A win for global human rights' as EU agrees on tighter rules for surveillance tech exports | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "The European Union on Monday agreed to tighten up rules for the sale and export of cyber-surveillance technology.\nEU lawmakers and the European Council reached a provisional deal to update controls of so-called dual-use goods such as facial recognition technology and spyware to prevent them from being used to violate human rights.\nUnder the new rules, European companies will have to apply for government licenses to export certain products and they'll have to meet criteria that have been beefed up to include requirements to consider whether the sale poses a risk to human rights.\nEU countries will also have to be more transparent by publicly disclosing details about the export licenses they grant. And the rules can also be swiftly changed to cover emerging technologies.\nDual-use technology could also include high-performance computers, drones and certain chemicals.\n\"Today is a win for global human rights. We have set an important example for other democracies to follow,\" Marketa Gregorova, a European Parliament lawmaker who was one of the lead negotiators, said in a statement. \"Authoritarian regimes will no longer be able to secretly get their hands on European cyber-surveillance.\"\nThe current rules in vigour were introduced in 2009. The EU council said in a statement that the system needed \"to be adapted to the changing technological, economic and political circumstances\".\nPeter Altmaeier, economy minister for Germany — which currently holds the bloc's rotating presidency — said \"the new rules strike the right balance between strengthening the competitiveness of the EU, ensuring our own interests and promoting human rights.\"\nThe agreement comes after years of negotiations and still needs formal approval from the European Parliament and other bodies but that's expected to be a formality.\nHuman rights groups have been urging the EU to tighten up export rules. Amnesty International said in a recent report that the bloc's existing regulations fail to address the \"rapidly changing surveillance dynamics\" or take into account emerging risks posed by new digital surveillance technology. The group said it found three European companies that sold digital surveillance tech to China.", "url": "https://www.euronews.com/2020/11/09/a-win-for-global-human-rights-as-eu-agrees-on-tighter-rules-for-surveillance-tech-exports"}