{"authors": [], "date_download": "2020-12-28 15:49:09", "date_modify": "2020-12-28 15:49:09", "date_publish": "2020-11-17 21:07:36", "description": "Cathy Kearney, Apple's VP for European Operations, says the iPhone maker's spending in Europe has increased by 15%", "filename": "2020_11_17_europe-s-gdpr-provides-our-privacy-model-around-the-world-apple-vp-says_1609170549.html", "image_url": "https://static.euronews.com/articles/stories/05/13/62/40/1000x563_cmsv2_b3b48a36-658e-50a5-9bed-f2f3dbb65c95-5136240.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2020_11_17_europe-s-gdpr-provides-our-privacy-model-around-the-world-apple-vp-says_1609170549.html", "title": "Europe's GDPR provides our privacy model around the world, Apple VP says", "title_page": "Europe's GDPR provides our privacy model around the world, Apple VP says | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "A senior Apple executive has praised GDPR, the European Union’s regulation for data privacy, saying the firm uses it as a model for its operations around the world, including in the United States.\nCathy Kearney, the firm’s Vice President for European Operations, told the European Business Summit, which this year is being held virtually, that the iPhone maker believed “privacy is a fundamental human right”.\n“Apple devices are important to so many parts of our customers' lives. What they share from these experiences and who they share it with should be up to them,” she said.”\nKearney continued: “We welcome the transformative work towards privacy and data protection achieved in the EU with GDPR and Apple has chosen to apply this as a global standard.\n“Our customers in the US enjoy the same level of data protection as our customers in the EU.\n“We believe it’s important to participate in the debate as policymakers consider how best to ensure important values like privacy are secured in the future.”\nGDPR, also known as the General Data Protection Regulation, outlines the EU's privacy rules.\nIt gives individuals the right to find out whether, where and for what purpose their personal data is being processed, and regulators the power to fine tech firms.\nEuropean growth\nKearney said Apple now had 25,000 employees in Europe and that its spending across the continent had grown by 15% compared to the year to date in 2019.\nThe firm has spent over €66 billion with “thousands” of suppliers and partners across Europe, she added.\nShe said Apple was “proud to be a part of the European family”, and that the values it shares with European citizens was one reason it has invested heavily in the continent.\nApple says its spending in Europe increased 15% compared to 2019 Ng Han Guan/AP\nHer remarks on GDPR came a day after Austrian activist Max Schrems accused Apple of breaking EU law with a tracking code known as IDFA.\nHis campaign group noyb has filed complaints in Germany and Spain saying the IDFA tracked every user’s mobile and online behaviour without their knowledge of agreement.\n“Just like a license plate this unique string of numbers and characters allows Apple and other third parties to identify users across applications and even connect online and mobile behaviour,” noyb said in a statement.\nThe group’s lawyer Stefano Rossetti added: “Tracking is only allowed if users explicitly consent to it.\n“While Apple introduced functions in their browser to block cookies, it places similar codes in its phones, without any consent by the user. This is a clear breach of EU privacy laws.”\nBut Apple said the complaint was “factually inaccurate”.\n“We look forward to making that clear to privacy regulators should they examine the complaint,” the firm said in a statement.", "url": "https://www.euronews.com/2020/11/17/europe-s-gdpr-provides-our-privacy-model-around-the-world-apple-vp-says"}