{"authors": [], "date_download": "2020-12-28 15:49:19", "date_modify": "2020-12-28 15:49:19", "date_publish": "2020-12-21 12:10:23", "description": "New hacking scams - Here's how to avoid them", "filename": "2020_12_21_new-hacking-scams-here-s-how-to-avoid-them_1609170559.html", "image_url": "https://static.euronews.com/articles/stories/05/20/20/36/1000x563_cmsv2_14aa7eea-6ae6-571f-a338-8bf1da0b4212-5202036.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2020_12_21_new-hacking-scams-here-s-how-to-avoid-them_1609170559.html", "title": "New hacking scams - Here's how to avoid them", "title_page": "New hacking scams - Here's how to avoid them | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "Flying cars and robot dogs to gene editing and bioengineering, just some of the technology that was on show earlier this month at GITEX (Gulf Information Technology Exhibition). Now in its 40th edition, GITEX was the only major tech event to go live and attended in person. It hosted 1200 Exhibitors from over 60 countries.\nOne topic that was put under the spotlight at this years event was cybersecurity. It’s a cause of concern for many industries. According to Cybersecurity Ventures, a recent study predicts cybercrimes will cost the world €4.9 trillion a year by next year (2021).\nSpeaking at the event was hacker, inventor and future technologist, Pablos Holman. Almost 20 years ahead of the game Holman has been working with cryptocurrency since the early 1990s. At GITEX he discussed the potential of merging Blockchain with artificial intelligence to build safer cities and enhancing government services.\nWhen speaking about cybersecurity Holman told Euronews \"it's a game of cat and mouse. But the way that you lose the game is to stop playing\". He explained that hackers look for problems in technology and software, and the defenders find ways to patch these problems. Since lockdown hackers have had more time to fine-tune their scams, making 'the game' easier to lose.\nWorld-renowned cybersecurity expert, ethical hacker, author and former U.S. Marine, Bryan Seely also spoke at GITEX. Seely became recognised in the hacking world in 2014 when he became the only person to ever wiretap the United States Secret Service and FBI to expose hidden criminal activity.\nSeely told Euronews that since the world went into lockdown hackers have created new and more effective ways to scam people and corporations. One way that many people have fallen victim to hackers is clicking on a phishing email link that has been coordinated with home deliveries. Seely said it is almost impossible to tell the difference from the hackers' email and the companies they are impersonating.\nWhen asked how to be safe online, he stressed 'never click on a link from someone you do not know'. Other points he advised were to never reuse passwords and to always activate two-factor authentication. Highlighting the importance of being safe online, he said: \"if you don't, you deserve what's going to happen to you\".", "url": "https://www.euronews.com/2020/12/21/new-hacking-scams-here-s-how-to-avoid-them"}