{"authors": ["Assaf Barnea", "Ceo Sanara Ventures"], "date_download": "2020-12-28 15:49:11", "date_modify": "2020-12-28 15:49:11", "date_publish": "2020-12-21 15:30:43", "description": "Global challenges turned into constructive solutions for all", "filename": "2020_12_21_global-challenges-turned-into-constructive-solutions-for-all_1609170551.html", "image_url": "https://static.euronews.com/articles/stories/05/19/53/28/1000x563_cmsv2_82033570-5a34-5e93-b721-b7bd941832f1-5195328.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2020_12_21_global-challenges-turned-into-constructive-solutions-for-all_1609170551.html", "title": "Global challenges turn to constructive solutions for all", "title_page": "Global challenges turn to constructive solutions for all | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "In this December edition of Business Line, the monthly business barometer from Dubai, we take a look at three innovative business enterprises transforming some of the year's worst news into helpful solutions and in some cases even life-saving ones.\nUpcycling plastic waste\nWe start with plastics that pollute and plague our planet. Micro-plastics are everyone, from the deepest oceans to the highest mountains. Amos Wemanya, an environmental campaigner for Greenpeace, even says that according to a study they did in 2018, \"microplastics are in our food, they are in our air, they are in our water, and they are causing health problems.\"\nThe pavers made from recycled plastic by Gjenge Makers Euronews\nBut what if there was a way to turn plastic waste into something useful and make a profit? That’s precisely what four Kenyan engineers have set out to do.\nThree years ago Kenya imposed what was praised as the World’s strictest ban on the use, manufacture and import of plastic. One Nairobi-based manufacturing company is hoping to stem the seemingly interminable flow of plastic waste by transforming it into environmentally friendly paving bricks.\nNzambi Matee, the co-founder of Gjenge Makers, the company in question, says that Nairobi alone generates about 500 metric tones of plastic waste every single day, \"only a fraction of this is recycled. The rest finds its way into the environment and to the dumpsite\". That's what made them see waste as a resource in itself.\nThank you to all our plastic waste partners Guala Closures Kenya@GualaClosuresuk@GualaClosuresSA\nMr Green Africa https://t.co/x61UCrU97k — Nzambi Matee (@nzambimatee_ke) December 17, 2020\nTheir adventure began in 2017 when they started collecting plastic waste and selling it to recyclers. But only a few months down the line, they realised they were collecting more than they could resell, more than recyclers could handle. That's when they realised that they needed to do something else with the plastic waste, something that is also financially lucrative. They started transforming the plastic waste into pavers.\nThe building blocks of a Green initiative\nThe plastic is crushed into small pellets and then sorted according to colour. After mixing-in sand, and the desired colour pigment, they are moulded and put into a hydraulic press.\nAnn Muthoni, Programme Coordinator atMukuru Slums Development Projects says \"Walking on them feels like you are walking on rubber (...) They are environmentally friendly. They are also beautiful because we get different colors, and they are easy to clean, especially when the cleaners are sweeping them, and they have really transformed our institution.\"\nGjenge Makers can produce 1500 pavers a day and they sell for between 8-10 euros per square metre. They're truly paving the way for the company to be both profitable and ecologically sound.\nRevolutionary vaccine research\nGenetic engineering and gene editing are being touted as the next multi-trillion dollar industry within healthcare. Leading COVID-19 vaccination manufacturers are using this technology. At this year's Gulf Information Technology Exhibition in Dubai, Euronews' Jane Witherspoon, paneled a discussion with some leading experts to get the latest information.\nWhere might the next big breakthrough come from?\nAccording to Professor Zeev Rotstein, the Director-General of the Hadassah Medical Organization, it'll come from genomics. As he correctly states, \"all the production of the vaccines against COVID-19 right now are based on genomic, CRISPR activity\".\nBut what exactly can Genomics do?\nDr. Manal Taryam, the CEO of Primary Health Care Sector, Dubai Health Authority, says \"not only will it provide us the database on which we can build the management plan, it will also give us a fast track towards the personalised medicine. And then we won't be treating the disease. We will be treating the person who's affected by that disease.\"\n\"It will also give us a fast track towards personalised medicine\". Dr Manal Taryam\nBut genomics is more. Dr. Taryam believes it's the future to controlling many diseases, not just the pandemic:\n\"To be able to understand the genomic map of how the community or the population is going to respond to any virus or bacteria is a very important milestone in predicting the outcome of any disease or any pandemic\".\nWhat is required to create an ecosystem that can support innovations in health care?\nAssaf Barnea, CEO of Sanara Ventures thinks we have to be more prepared and to adapt innovation for care using AI digital health. He says there's a move towards performance-based medicine rather than fee per service. He thinks this trend will eventually create an ecosystem that will \"force the regulation, will force the adaptation of new technology, value-based medicine, which we now see will force hospitals and physicians to adopt, not just new technologies, by the way, but us as a market, as investors also to adopt new business models.\"\n\"This crisis is an opportunity for a better embracement of medical innovation\". Assaf Barnea CEO Sanara Ventures\nDespite the huge terrible consequences of the pandemic, many leading experts see the innovation and creation in the fight against the virus as having pushed the medical world in a more positive and effective direction.\nPersonalised online Christmas shopping\nWith a third of UK Christmas shopping forecast to take place online this year, retailers have been adapting their business models to meet the demands of the pandemic. But for people who prefer to cruise the aisles in person, some are now offering what they call ‘personal shopping experiences.’\nAccording to the Centre for Retail Research, 33% of total retail sales in the UK will be online this Christmas. That means even England’s oldest shopping centre, London's luxury Burlington Arcade, has boosted its digital services.\nMark Lord, Head Beadle at Burlington Arcade Euronews\nFor Mark Lord, Head Beadle at Burlington Arcade, all of the retailers there have adapted to the challenges of 2020. They offer click-and-collect that can even be delivered to your hotel, home address and if you're lucky enough to have a country address, that can be arranged too. He says that \"even though we're 201-years-old, we have adapted to the modern world.\"\nFor a personalised day on the town, stores can be contacted directly to book an appointment. As Mark Lord says, \"we want to make it an experience so that the minute you step in and you're greeted by myself or one of my colleagues, the worries of 2020 sort of disappear a little bit, and you can start to enjoy a more normal Christmas.\"", "url": "https://www.euronews.com/2020/12/21/global-challenges-turned-into-constructive-solutions-for-all"}