{"authors": [], "date_download": "2020-12-28 15:49:09", "date_modify": "2020-12-28 15:49:09", "date_publish": "2020-11-17 19:02:24", "description": "The European Business Summit #EBS2020 discusses whether COVID-19 has helped increase awareness of the need for recycling and sustainable consumption", "filename": "2020_11_17_how-can-recycling-help-the-european-union-achieve-its-green-targets_1609170549.html", "image_url": "https://static.euronews.com/articles/stories/05/13/58/30/1000x563_cmsv2_632c0cdd-367e-5fc7-85dc-8539421da571-5135830.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2020_11_17_how-can-recycling-help-the-european-union-achieve-its-green-targets_1609170549.html", "title": "How can recycling help the European Union achieve its green targets?", "title_page": "How can recycling help the European Union achieve its green targets? | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "In the European Union, 93% of citizens see climate change as a serious problem.\nThis is why this year the EU Green deal and the way it can help the region's economy recover from the COVID19 crisis were among the main topics at the European Business summit in Brussels.\nThe big question: how could recycling and the circular economy help the EU achieve its green targets?\nAs of last year six in ten European consumers said they would be willing to pay more for products that have a more sustainable packaging.\nSince the COVID-19 pandemic struck the world in March, even more are ready to put their money where their mouth is.\nVasileois Rizos, Research Fellow and Head of Sustainable Resources and Circular Economy, CEP believes that during the pandemic and lockdowns across Europe, consumers have been increasingly interested in green products.\nHe says spending more time at home made people “rethink the priorities and sometimes better collect or sort out waste.”\nFrancoise Bonnet, Secretary General at the Association of Cities and Regions for Sustainable Resource management, said consumers needed more information.\nAnd that is what the new Consumer Agenda should help with.\nFor Joanna Drake, the deputy director-general of the EU Directorate-General for Environment, empowering consumers is a key point on the road to success.\n“It is a cornerstone of the success to whether we can make these personal daily changes in our behaviour, ”she said.\n“Because it is not only the behaviour of companies, but they do it with the hope also that the consumer will want to change.\n“And I just want to say, you know there is a lot of talk about the pandemic, that maybe one doesn't go with another. During the COVID crisis, and it is still on, the demand for sustainable products has actually grown.”\nThe agenda lays out a vision for consumer policy until 2025 and tackles five areas: including environmental aspects to help consumers play a more active role.", "url": "https://www.euronews.com/2020/11/17/how-can-recycling-help-the-european-union-achieve-its-green-targets"}