{"authors": [], "date_download": "2020-12-28 15:49:10", "date_modify": "2020-12-28 15:49:10", "date_publish": "2020-11-17 20:09:38", "description": "Do not cut back on military spending because of COVID-19, @EUDefenceAgency chief warns #EBS2020 panel", "filename": "2020_11_17_don-t-cut-back-on-military-spending-because-of-covid-19-european-defence-chief-warns_1609170550.html", "image_url": "https://static.euronews.com/articles/stories/05/13/62/12/1000x563_cmsv2_fb43e1b3-1fd7-5a70-9fda-27ff437b4f65-5136212.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2020_11_17_don-t-cut-back-on-military-spending-because-of-covid-19-european-defence-chief-warns_1609170550.html", "title": "Don't cut back on military spending because of COVID-19, European defence chief warns", "title_page": "Don't cut back on military spending because of COVID-19, European defence chief warns | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "European defence chiefs have warned against “chaotic” cutbacks to military spending because of budgetary pressures caused by COVID-19.\nThe global pandemic has pressured leaders in Europe to re-evaluate how much they money put both into their national defence budgets and into the European Defence Fund.\nIn May, the fund’s budget allocation was revised to €8 billion.\nBut Jiří Šedivý, the chief executive of the European Defence Agency, said it was important that the pandemic did not distract policymakers from the security situation of the new decade.\nHe pointed out that cuts to defence budgets on the continent following the 2007-08 financial crisis had had a dramatic impact, and that most countries had only returned to their pre-2007 levels last year.\nEuropean defence spending fell by as much as 11 percent in the decade after the crash, according to DGBAP, the German Council on Foreign Relations.\nThe discussion on European defence took place on Tuesday European Business Summit\nŠedivý told a panel at the European Business Summit this week: “We should avoid actually what happened ten years ago when, as a consequence of the financial economic crisis, member states in EU, allies in NATO were cutting deep, very chaotically. We managed to get onto the level of 2007, before the crisis, only last year.\n“We need to try to convince member states and allies that they should try to moderate their cuts.\n“Also, the geopolitical situation is much worse than it used to be 10 years ago. So despite COVID, geopolitical competition is ongoing and even sharpening.”\nFor Joanneke Balfoort from the European External Action Service (EEAS), the EU’s diplomatic service, the solution was for member states to work together and share the costs of defence spending.\n“I think that the issue that we're looking at is to cooperate and through cooperation to be more effective and efficient, she said.\n“I think that's one thing you see that member state are still [having] to get used to, but in the end I think you will get more defence with less.”\nBoth the EEAS and the EDA operate as part of a European Union mechanism known as PESCO, in which 25 of the EU’s 27 member states are working to integrate their armed forces.\nDenmark and Malta have opted out of PESCO.\nEarlier this year the EU launched a \"task force\" to mobilise national armies to transport patients and medical supplies from one country to another within the bloc.", "url": "https://www.euronews.com/2020/11/17/don-t-cut-back-on-military-spending-because-of-covid-19-european-defence-chief-warns"}