{"authors": [], "date_download": "2020-12-28 15:49:15", "date_modify": "2020-12-28 15:49:15", "date_publish": "2020-11-19 15:18:17", "description": "Football's governing body is preparing to mandate clubs to allow at least 14 weeks of maternity leave paid at a minimum two-thirds of a player’s full salary.", "filename": "2020_11_19_new-fifa-rules-to-protect-female-players-maternity-rights_1609170555.html", "image_url": "https://static.euronews.com/articles/stories/05/14/01/66/1000x563_cmsv2_6d14d297-4480-59cb-98f8-73b9ba6db4a7-5140166.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2020_11_19_new-fifa-rules-to-protect-female-players-maternity-rights_1609170555.html", "title": "New FIFA rules to protect female players' maternity rights", "title_page": "New FIFA rules to protect female players' maternity rights | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "Female football players should soon get their maternity rights protected under new employment rules announced on Thursday by FIFA.\nFootball's governing body is preparing to mandate clubs to allow at least 14 weeks of maternity leave paid at a minimum two-thirds of a player’s full salary. National football bodies can insist on more generous terms.\n“Her club will be under an obligation to reintegrate her into football activity and provide adequate ongoing medical support,” FIFA said.\nAny club that ended a player’s contract for becoming pregnant faces having to pay compensation and a fine, and being banned from the transfer market for one year.\n“The idea is to protect female players before, during and after childbirth,” FIFA chief legal officer Emilio Garcia said on a conference call.\nThe move is seen as a key step in professionalising women’s soccer — and respecting players’ family lives — after a successful 2019 World Cup and more investment by elite clubs in having a women’s team.\nUnited States forward Alex Morgan, a World Cup winner last year, signed with Tottenham in September, four months after giving birth to her first child. She played her first game this month.\nThe rules, created with help from world players' union FIFPro, are expected to be approved by the FIFA Council next month and would take effect on Jan. 1.\nAlthough FIFA’s judicial bodies have not been presented with contract disputes over maternity rights, Garcia targeted getting ahead of potential problems in the fast-growing women’s game.\n“We think these rules are part of common sense,” he said of the move, which follow International Labour Organisation standards on compensating maternity leave.\nAt least eight weeks of the 14-week minimum maternity leave must be after the player gives birth.\nFIFA also plans to help clubs by letting them register a player outside of a transfer window as a temporary replacement during a maternity leave.\nCoaches will also get formal contractual protection in the proposal.\n“FIFA has never taken care of them (coaches) for the last 120 years,” Garcia said, predicting the new rules would benefit coaches who work internationally.\nThe drafted rules aim to “protect contractual stability, achieve greater transparency and make sure that coaches also get paid on time,” FIFA said.", "url": "https://www.euronews.com/2020/11/19/new-fifa-rules-to-protect-female-players-maternity-rights"}