{"authors": ["Pablos Holman", "Hacker", "Inventor"], "date_download": "2020-12-28 15:49:19", "date_modify": "2020-12-28 15:49:19", "date_publish": "2020-12-19 15:00:36", "description": "Humans and robots battle it out for control of the future", "filename": "2020_12_19_humans-and-robots-battle-it-out-for-control-of-the-future_1609170559.html", "image_url": "https://static.euronews.com/articles/stories/05/19/52/82/1000x563_cmsv2_be7a2fb4-9277-5420-9b66-0991f7e4f324-5195282.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2020_12_19_humans-and-robots-battle-it-out-for-control-of-the-future_1609170559.html", "title": "Humans and robots battle it out for control of the future", "title_page": "Humans and robots battle it out for control of the future | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "From bioengineering and gene editing to cybersecurity, 5G, and much more, the future is very much under the spotlight at the 40th annual Gulf Information Technology Exhibition in Dubai. It’s the only major tech event to have gone ahead this year with over 1200 exhibitors from 60 countries.\nMesmerised\nAmong the most eye-catching exhibits, incredibly lifelike humanoids called Mesmer robots, designed by Engineered Arts. With the ability to sense body language and even mood, they have uncanny powers of interaction.\n“What is your purpose? Why do you exist?” I ask Jen the Robot.\n“That is a very deep and philosophical question James,” comes back the reply. “Why do you exist?”\nAlso present were some world-famous cybersecurity experts. Notorious hacker Pablos Holman has helped build spaceships, invented a machine to suppress hurricanes and began developing cryptocurrencies way back in the 1990s.\n“The economic value is in corporations and the computers they run,” he argues. “That's the battlefield of the future. We live in a world with full-scale economic warfare in cyber security and cyber warfare. Right? And it's I'm not trying to scare you. I’m just saying that's the reality. You lose the game if you don’t play.”\nScammers have been upping their game\n“You have an increase in people staying home and not knowing how to generate revenue, whether it's illegal or otherwise,” says ethical hacker, writer and conference speaker Bryan Seely. “So the scammers have been sort of upping their game and getting more and more creative. Social engineering, phishing, targeting users to trick them, that has increased by quite a lot. Ransomware is going up, and it's harder to defend a company when your company is now spread out all over the place and everyone's working on VPNs. And there's a lot less interactions and a lot less communication and central management of anything because no one is central anymore. We call it the border. So the border of a company is now almost gone.”\nInnovations in Healthcare\nThe pandemic has led to unprecedented adoption of and reliance on new technologies. And Innovations in healthcare in particular were the subject of intense scrutiny at this year’s GITEX.\n“There was an increase of the telemedicine services because before people would move to the hospitals and then make appointments with the doctors and see them,” says Shamim Nabuuma Kalilsa, the CEO of CHIL AI LAB GROUP. “But this time around they would not move, there were lockdowns so there was a bit of adopting the technology. So this has really changed and the people are adapting to it.”\nClinical strategist Prateek Sardana is showing off Etisalat Entreprise’s contribution to the healthcare revolution.\n“This is a connected health at home solution”, he explains. “Which is a data orchestration platform that pulls in data from different sensors around the home and integrates them with some of our most innovative solutions, like telemedicine.\n“So this is a glucometer. Right, which captures your blood sugar levels and then that is in real-time transmitted to the dashboard. This is a pulse oximeter, measuring oxygen saturation in the blood and very relevant in the times of covid.\n“Ultimately, this is integrated with an electronic medical record system of a hospital\n“So if it's showing a prompt to the physician that there is an irregular heart rhythm for a certain patient, the physician might call the patient for a visit or maybe send an ambulance.”\nClarity over values\nCertain innovations here have the power to save lives… but others shouldn’t fall into the wrong hands.\nWhat concerns me is human decision making. It's still up to us to decide what we care about, what world we want to build and to use these technologies to help us create that future. Pablos Holman Hacker, Inventor and Futurist\n“What concerns me is human decision making,” says Holman. “It's still up to us to decide what we care about, what world we want to build and to use these technologies to help us create that future. So, you know, we have to get really clear about our values. What do we care about? What world are we trying to create and what technologies could help us get there?”", "url": "https://www.euronews.com/2020/12/19/humans-and-robots-battle-it-out-for-control-of-the-future"}