{"authors": [], "date_download": "2020-12-28 15:49:17", "date_modify": "2020-12-28 15:49:17", "date_publish": "2020-08-06 19:37:45", "description": "The social media platform said it will provide \"people with context so they can make informed decisions about what they see\".", "filename": "2020_08_06_twitter-to-label-government-officials-and-state-backed-news-accounts_1609170557.html", "image_url": "https://static.euronews.com/articles/stories/04/86/70/68/1000x563_cmsv2_fdcdc41a-8475-5f42-a48b-1d14c0848192-4867068.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2020_08_06_twitter-to-label-government-officials-and-state-backed-news-accounts_1609170557.html", "title": "Twitter to label government officials and state-backed news accounts", "title_page": "Twitter to label government officials and state-backed news accounts | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "Twitter announced on Thursday that it will introduce a new label for government officials and state-backed media organisations in an effort to be more transparent.\nThe social media platform added that it will also \"no longer amplify state-affiliated media accounts or their Tweets through our recommendation systems, including on the home timeline\".\nThe new feature will first be applied to countries represented in the five permanent members of the United Nations' Security Council: China, France, Russia, the UK, and the US but the platform said it would then extend it to other countries.\nOn the political side, the new labels will be added to the account of key government officials including foreign ministers, institutional entities, ambassadors, official spokespeople, and key diplomatic leaders.\nHeads of states are to be excluded, \"as these accounts enjoy widespread name recognition, media attention, and public awareness,\" Twitter said.\n\"Our focus is on senior officials and entities that are the voice of the nation state abroad,\" it went on.\nThe label will also be added to state-affiliated entities, their editors-in-chief, and/or their senior staff.\nThe technology giant said it will consider as state-affiliated media any outlet where the state exercises control over editorial content through financial resources, direct or indirect political pressures, and/or control over the production and distribution\".\nIt flagged that state-financed media organisations with editorial independence will be excluded. These include the BBC in the UK and the NPR in the US.\n\"Our mission is to serve the public conversation and an important part of that work is providing people with context so they can make informed decisions about what they see and how they engage on Twitter,\" Twitter said.\nYouTube started labelling content from state-backed media accounts in 2018. Facebook has been labelling state-controlled media and blocking ads from them to people in the US since June.\nEarlier this year, Twitter drew the ire of the US President after it introduced a fact-check label and promptly used it on a tweet from Donald Trump.\nThe platform has also banned all political advertising as well as state-backed media advertising.", "url": "https://www.euronews.com/2020/08/06/twitter-to-label-government-officials-and-state-backed-news-accounts"}