{"authors": [], "date_download": "2020-12-28 15:49:18", "date_modify": "2020-12-28 15:49:18", "date_publish": "2020-10-31 23:18:56", "description": "England win 2020 Six Nations championship", "filename": "2020_10_31_england-win-2020-six-nations-championship-after-ireland-fail-in-paris_1609170558.html", "image_url": "https://static.euronews.com/articles/stories/05/09/76/52/1000x563_cmsv2_5fc90905-8f1c-5dff-970d-89074f96a15f-5097652.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2020_10_31_england-win-2020-six-nations-championship-after-ireland-fail-in-paris_1609170558.html", "title": "England win 2020 Six Nations championship after Ireland fail in Paris", "title_page": "England win 2020 Six Nations championship after Ireland fail in Paris | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "England won the 2020 Six Nations rugby title after thrashing Italy on Saturday, but they had to wait for the result of a tense match between France and Ireland in Paris before they could celebrate.\nEddie Jones' side triumphed on the final day of what became the longest Six Nations tournament in history due to the delay resulting from the initial COVID lockdown.\nFrance's 35-27 victory over Ireland gave England their first title since 2017, their third in five years under Jones, and a record-extending seventh in 21 editions since the competition was expanded to embrace Italy in 2000.\nAfter a scrappy first half in Rome, England grew in confidence to score with relative ease in the second half, leaving the Irish and the French with a mountain to climb. Ireland did lead France at one point but the game slipped from them, and with that - the championship, as they needed to beat France by six or more points after England's tally against the Italians.\nBen Youngs scored two tries as England cruised to a 34-5 victory, and became only the second player to do win 100 caps for the country after Jason Leonard.\nEngland will receive the trophy upon their return to the UK, whose prime minister, Boris Johnson announced a new national lockdown to begin on Thursday.", "url": "https://www.euronews.com/2020/10/31/england-win-2020-six-nations-championship-after-ireland-fail-in-paris"}