{"authors": [], "date_download": "2020-12-28 15:49:18", "date_modify": "2020-12-28 15:49:18", "date_publish": "2020-10-29 17:48:00", "description": "Russia has allowed thousands of people to attend sporting events in recent weeks including Champions League games and an F1 race. #COVID19", "filename": "2020_10_29_coronavirus-russia-wants-to-keep-sports-fans-in-stadiums-despite-covid-19-pandemic_1609170558.html", "image_url": "https://static.euronews.com/articles/stories/05/09/38/82/1000x563_cmsv2_562dd787-bf5a-51ba-9f4c-c60c165a29ea-5093882.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2020_10_29_coronavirus-russia-wants-to-keep-sports-fans-in-stadiums-despite-covid-19-pandemic_1609170558.html", "title": "Coronavirus: Russia wants to keep sports fans in stadiums despite COVID-19 pandemic", "title_page": "Coronavirus: Russia wants to keep sports fans in stadiums despite COVID-19 pandemic | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "As the coronavirus infection rate climbs in Russia, the country's sports minister said Thursday he would try to ensure fans can still attend sporting events.\nRussia has allowed some of the biggest crowds at sports events in Europe, even as some other countries revert back to empty stadiums.\nNearly 16,700 people watched a Champions League game last week between Zenit St. Petersburg and Brugge, the highest so far in the competition's group stage, and 10,500 were at Krasnodar's game against Chelsea on Wednesday.\n\"We will do everything possible so that sport is not left without spectators and so that this atmosphere doesn't leave the stadiums and our lives,\" sports minister Oleg Matytsin said in comments reported by the Tass state news agency.\nMatytsin said he would ensure clubs and regional governors had input into decision-making and that local situations would be taken into account.\nBesides football, Russia has allowed fans to attend other events at lower-than-usual capacity. Up to 30,000 people were allowed to attend each day of the Russian Grand Prix in Sochi last month, higher than any other Formula One race since the coronavirus pandemic disrupted the season.\nHowever, some Russian regions have imposed their own, lower limits for attendance or barred fans altogether. The public health authority for Moscow sharply reduced the number of fans allowed at Spartak Moscow soccer games following concerns about fans gathering close together and claims the actual attendance for one game was higher than officially recorded.", "url": "https://www.euronews.com/2020/10/29/coronavirus-russia-wants-to-keep-sports-fans-in-stadiums-despite-covid-19-pandemic"}