{"authors": [], "date_download": "2020-12-28 15:49:08", "date_modify": "2020-12-28 15:49:08", "date_publish": "2020-12-17 08:56:25", "description": "Texas Attorney General Ken Paxton announced the suit, arguing that \"this Goliath of a company is using its power to manipulate the market, destroy competition, and harm you, the consumer.\"", "filename": "2020_12_17_google-sued-by-10-us-states-for-anti-competitive-online-ad-sales_1609170548.html", "image_url": "https://static.euronews.com/articles/stories/05/20/61/64/1000x563_cmsv2_2338df9c-6d89-56d9-ba30-63baeff3a06a-5206164.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2020_12_17_google-sued-by-10-us-states-for-anti-competitive-online-ad-sales_1609170548.html", "title": "Google sued by 10 US states for 'anti-competitive' online ad sales", "title_page": "Google sued by 10 US states for 'anti-competitive' online ad sales | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "Ten US states on Wednesday brought a lawsuit against Google, accusing the search giant of “anti-competitive conduct\" in the online advertising industry, including a deal to manipulate sales with rival Facebook.\nTexas Attorney General Ken Paxton announced the suit, which was filed in a federal court in Texas, saying Google is using its “monopolistic power” to control pricing of online advertisements, fixing the market in its favour and eliminating competition.\n“This Goliath of a company is using its power to manipulate the market, destroy competition, and harm you, the consumer,” Paxton said in the video posted on Twitter.\nGoogle, which is based in Mountain View, California, called Paxton's claims \"meritless\" and said the price of online advertising has fallen over the last decade.\n“These are the hallmarks of a highly competitive industry,” the company said in a statement. \"We will strongly defend ourselves from (Paxton's) baseless claims in court.”\nPaxton led a bipartisan coalition of 50 U.S. states and territories that announced in September 2019 they were investigating Google’s business practices, citing “potential monopolistic behaviour.”\nNow Texas is bringing the suit along with other Republican attorneys general from Arkansas, Idaho, Indiana, Kentucky, Mississippi, Missouri, North Dakota, South Dakota and Utah.\nThe complaint targets the heart of Google’s business — the digital ads that generate nearly all of its revenue, as well as all the money that its corporate parent, Alphabet Inc., depends upon to help finance a range of far-flung technology projects.\nAs more marketers have increased their spending online, those digital ads have turned Google into a moneymaking machine. Through the first nine months of this year, Google’s ad sales totalled nearly $101 billion (€82.5 billion), accounting for 86% of its total revenue.\nAnd now the states contend Google intends to use its alleged stranglehold on digital ads to choke off other avenues of potential competition and innovation. The company struck an illegal deal with Facebook, a major competitor for ads, to manipulate advertising auction, according to the complaint. Facebook declined to comment.\n“Google has an appetite for total dominance, and its latest ambition is to transform the free and open architecture of the internet,” the suit alleges.\nIn the “ad tech” marketplace that brings together Google and a huge universe of online advertisers and publishers, the company controls access to the advertisers that put ads on its dominant search platform. Google also runs the auction process for advertisers to get ads onto a publisher’s site. Nine of Google’s products in search, video, mobile, email, mapping and other areas are estimated to have over a billion users each, providing the company with a trove of users’ data that it can deploy in the advertising process.\nGoogle officials say the company shares the majority of its “ad tech” revenue with publishers, such as newspaper websites. An official recently rejected even the assertion that Google is dominant, saying that market dominance suggests abuse, which is foreign to the company.\nThe state's suit comes after the U.S. Justice Department sued Google in October for abusing its dominance in online search and advertising — the government’s most significant attempt to buttress competition since its historic case against Microsoft two decades ago.\nSeparately, the FBI is investigating whether Paxton, a close ally of President Donald Trump, broke the law in using his office to help a wealthy donor who is also under federal investigation. This fall, eight of the attorney general’s top deputies accused him of bribery, abuse of office and other crimes in the service of an Austin real estate developer who employs a woman with whom Paxton is said to have had an extramarital affair.\nAll eight of Paxton's accusers have since been fired or resigned, including the deputy attorney general who had been leading the office's probe of Google. The court complaint list attorneys with private firms in Houston, Chicago and Washington, D.C., as the lead lawyers on the case.\nPaxton announced the lawsuit the week after the U.S. Supreme Court rejected his legal push to overturn Joe Biden’s victory in the presidential election, a case that prompted widespread speculation that the attorney general is angling for a preemptive pardon from Trump.\nThe American Economic Liberties Project, an organisation that advocates for government action against business concentration, welcomed the states’ suit.\n“Google’s current business model is a threat to democracy and the free press,” Sarah Miller, the group’s executive director, said in a statement.", "url": "https://www.euronews.com/2020/12/17/google-sued-by-10-us-states-for-anti-competitive-online-ad-sales"}