{"authors": [], "date_download": "2020-12-28 15:49:13", "date_modify": "2020-12-28 15:49:13", "date_publish": "2020-10-08 15:23:48", "description": "It would allow 16 and 17-year-olds to terminate a pregnancy without getting consent from their parents.", "filename": "2020_10_08_spanish-government-wants-to-repeal-parental-consent-rule-for-abortions_1609170553.html", "image_url": "https://static.euronews.com/articles/stories/05/04/28/06/1000x563_cmsv2_deaa02d1-c9af-5507-943c-2ddcc85f6b97-5042806.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/2020_10_08_spanish-government-wants-to-repeal-parental-consent-rule-for-abortions_1609170553.html", "title": "Spanish government wants to repeal parental consent rule for abortions", "title_page": "Spanish government wants to repeal parental consent rule for abortions | Euronews", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "Spain's government has revealed it's planning to repeal a reform on an abortion law that currently requires girls of certain ages to get parental consent before terminating their pregnancy.\nThe reform, which was introduced in 2015 by the conservative Popular Party, says girls of 16 and 17 years old can no longer have an abortion without guardian consent.\nSpeaking in the Congress of Deputies on Wednesday, equality minister Irene Montero said a repeal of the reform was \"more than necessary,\" as she stressed: \"All women have the right to decide over their bodies.\"\nThe equality ministry will now need to submit its proposal for the repeal to the public.\nIt will then need to be approved by a majority in the Congress of Deputies in order to pass.\nBut Spain's current coalition - the Socialist Party (PSOE) and Undas Podemos - does not currently have a majority number of seats in the chamber, meaning getting this through the vote could be difficult.\nFar-right Vox, for instance, is the party with the third most seats in congress and has suggested it won't support the vote.\nCurrently, women can terminate their pregnancy at any time up until the 14th week of their term.\nThe 2010 law, prior to the reform, stipulated that parents should attend a clinic with an underage girl unless she claimed that divulging the information to her family would cause harm.\nFour years later, the government of then prime minister Mariano Rajoy attempted to revert the Spanish system to a case-by-case basis on terminations that would limit such procedures to victims of rape, or where the mother's health could be at risk.\nThis proposal was widely criticised by women's groups, and members of the ruling party itself, and it, therefore, settled on the reform for parental consent.", "url": "https://www.euronews.com/2020/10/08/spanish-government-wants-to-repeal-parental-consent-rule-for-abortions"}