{"authors": ["Rachel Graham"], "date_download": "2020-12-28 15:49:12", "date_modify": "2020-12-28 15:49:12", "date_publish": "2019-08-22 15:39:08", "description": "Stella McCartney and Taylor Swift team up for clothing and accessories", "filename": "living_2019_08_22_stella-mccartney-and-taylor-swift-team-up-for-clothing-and-accessories_1609170552.html", "image_url": "https://static.euronews.com/articles/stories/04/10/08/54/1000x563_cmsv2_f2ca72f2-aa76-56be-a46e-4adfc21cc8fa-4100854.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/living_2019_08_22_stella-mccartney-and-taylor-swift-team-up-for-clothing-and-accessories_1609170552.html", "title": "Stella McCartney and Taylor Swift team up for clothing and accessories", "title_page": "Stella McCartney and Taylor Swift team up for clothing and accessories | Living", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "Taylor Swift has teamed up with luxe fashion label Stella McCartney for a new line of sustainable designer wear.\nCalled ‘Stella x Taylor Swift’, the range is set to be a limited-edition merchandise capsule inspired by Taylor Swift’s upcoming album ‘Lover’.\n“It’s sustainable and it’s yours soon,” McCartney announced on social media.\nSwift and McCartney presented a live event on YouTube, coinciding with the drop of the ‘Lover’ single music video. The live stream debuted a host of looks from the line, many of which featuring a signature pastel tye-die colour palette and images of Taylor's cat.\n“It’s been SO much fun to work/dream up cute stuff with my friend Stella McCartney to create a line inspired by my new album Lover,” Swift told fans in an Instagram post announcing the partnership.\n“Can’t wait to show you what we've been working on and tell you more about the pop up shop.”\nFans on the site left a host of comments requesting that the merchandise be accessibly priced, but with reported price tags of up to $1,995, the request may have come too late.\nTo celebrate the launch of the album, Swift is due to open a pop-up shop in New York between 23-25 August, according to Fashion Network. The shop will sell the first items in the range to be revealed: a bomber jacket and a handbag.", "url": "https://www.euronews.com/living/2019/08/22/stella-mccartney-and-taylor-swift-team-up-for-clothing-and-accessories"}