{"authors": ["Maeve Campbell"], "date_download": "2020-12-28 15:49:12", "date_modify": "2020-12-28 15:49:12", "date_publish": "2020-07-01 12:21:05", "description": "Zac Efron looks for solutions to climate change in new Netflix series", "filename": "living_2020_07_01_zac-efron-looks-for-solutions-to-climate-change-in-new-netflix-series_1609170552.html", "image_url": "https://static.euronews.com/articles/stories/04/77/99/66/1000x563_cmsv2_dae86b52-28db-5b23-a756-e4425f8d15cf-4779966.jpg", "language": "en", "localpath": "/home/mkette2s/news-please-repo//data/2020/12/28/euronews.com/living_2020_07_01_zac-efron-looks-for-solutions-to-climate-change-in-new-netflix-series_1609170552.html", "title": "Zac Efron looks for solutions to climate change in new Netflix series", "title_page": "Zac Efron looks for solutions to climate change in new Netflix series | Living", "title_rss": "NULL", "source_domain": "euronews.com", "maintext": "Zac Efron is starring in his own documentary series on Netflix, ‘Down to Earth’, which is all about exploring solutions to climate change around the world.\nThe actor might be known for his all singing, all dancing role in the High School Musical films, but he’s taking a break from Hollywood to visit eco communities in search of green ideas and inspiration.\n“We’re trying to find some new perspectives on some very old problems,” he says in the trailer, adding, “we need to start rethinking how we consume everything, from our food, to our power.”\nIn the series, Efron travels around the world with wellness expert Darin Olien to learn from various cultures and explore healthier, more sustainable ways of life. Granted, some of what he comes across may be more weird than wonderful, but it all comes under the umbrella of greener solutions to living.\nIn one scene, the actor looks at community fartbags, which are used to harness renewable sources of energy. In another, he is presented with a meal which has been smoked in poo, or as the chef calls it “dung-smoked”, to which he replies, “it doesn’t taste like dung”.\nZac Efron presented with a \"dung-smoked\" meal in Netflix show 'Down to Earth' Netflix\nThe adventurous pair visit France, Puerto Rico, London, Iceland, Costa Rica, Peru and Sardinia on their journey.\nThis isn’t the first time the actor has been involved in an environmentally themed show either. Back in April, Efron hosted the Great Global Cleanup, for the Discovery Channel, in celebration of Earth Day 2020.\nThe show put the spotlight on the next generation of climate activists and what they are doing to clean up the planet, from next-level recycling to innovative waste management.\nIn an Instagram post at the time, he wrote:\n\"Happy Earth Day! I have always been in awe of the magic and mystery of Mother Nature. Exploring the unknown has always been a true passion in my life and now, more than ever, I realize how important it is to take care of our planet, our people and every living thing we share it with. Please be safe, be healthy and be kind to one another. Join us tonight for the #greatglobalcleanup.\"\n‘Down to Earth’ will be released on Netflix on 10th July.", "url": "https://www.euronews.com/living/2020/07/01/zac-efron-looks-for-solutions-to-climate-change-in-new-netflix-series"}